Repository: qhta/DocxEditor
Catalog: DocxControls/Resources/PropertiesTooltips.*.resx
Languages: pl

# Application
source: Application name
pl: Nazwa aplikacji

source: Application version
pl: Wersja aplikacji

# Category
source: Category of the document
pl: Kategoria dokumentu

# Characters
source: Total number of characters
pl: Łączna liczba znaków

# CharactersWithSpaces
source: Total number of characters
pl: Łączna liczba znaków

# Company
source: Name of company
pl: Nazwa firmy

# ContentStatus
source: The status of the document content
pl: Stan zawartości dokumentu

# ContentType
source: The type of content that is contained in the document
pl: Typ zawartości zawartej w dokumencie

# Created
source: The date and time the document was initially created
pl: Data i godzina początkowego utworzenia dokumentu

# Creator
source: The individual or entity that created the document and its content
pl: Osoba lub podmiot, który utworzył dokument i jego zawartość

# Description
source: A description of the content contained in the document
pl: Opis treści zawartej w dokumencie

source: Digital signature
pl: Podpis cyfrowy

source: Document security
pl: Bezpieczeństwo dokumentu

source: Heading pairs
pl: Pary nagłówków

# HyperlinkBase
source: Relative hyperlink base
pl: Względna baza hiperłączy

source: Hyperlink list
pl: Lista hiperłączy

source: Hyperlinks changed
pl: Zmieniono hiperłącza

# Identifier
source: Document identifier
pl: Identyfikator dokumentu

# Keywords
source: Document keywords
pl: Słowa kluczowe dokumentu

# Language
source: A value that identifies the document content language
pl: Wartość identyfikująca język zawartości dokumentu

# LastModifiedBy
source: The user who last modified the document content
pl: Użytkownik, który jako ostatni zmodyfikował zawartość dokumentu

# LastPrinted
source: The date and time the document content was last printed
pl: Data i godzina ostatniego wydrukowania zawartości dokumentu

# Lines
source: Number of lines
pl: Liczba linii

source: Links up-to-date
pl: Hiperłącza są aktualne

# Manager
source: Name of manager
pl: Imię i nazwisko osoby odpowiedzialnej za dokument

# Modified
source: The date and time the document was last changed
pl: Data i godzina ostatniej zmiany dokumentu

# MultimediaClips
source: Total number of multimedia clips
pl: Łączna liczba klipów multimedialnych

# Pages
source: Total number of page
pl: Łączna liczba stron

# Paragraphs
source: Total number of paragraphs
pl: Łączna liczba akapitów

# PresentationFormat
source: Intended format of presentation
pl: Zamierzony format prezentacji

# Revision
source: The revision number of the document
pl: Numer wersji dokumentu

# ScaleCrop
source: Thumbnail display mode
pl: Tryb wyświetlania miniatur

source: Shared document
pl: Udostępniony dokument

# Subject
source: The topic of the document content
pl: Temat treści dokumentu

# Template
source: Name of document template
pl: Nazwa szablonu dokumentu

# Title
source: The name given to the document and its content
pl: Nazwa nadana dokumentowi i jego treści

# TitlesOfParts
source: Part titles
pl: Tytuły części

# TotalTime
source: Total edit time
pl: Łączny czas edycji

# Version
source: The version number of the document
pl: Numer wersji dokumentu

# Words
source: Word count
pl: Licznik słów

# PasswordProtected
source: Document is password protected
pl: Dokument jest chroniony hasłem

# ReadOnlyRecommended
source: Document is recommended to be opened as read-only
pl: Zaleca się otwieranie dokumentu w trybie tylko do odczytu

# ReadOnlyForced
source: Document is recommended to be opened as read-only
pl: Zaleca się otwieranie dokumentu w trybie tylko do odczytu

# LockedForAnnotation
source: Document is locked for annotation
pl: Dokument jest zablokowany w celu dodania adnotacji
