Repository: qhta/DocxEditor
Catalog: DocxControls/Resources/PropertiesDescriptions.*.resx
Languages: pl

# Application
source: Specifies the name of the application that created this document.
pl: Określa nazwę aplikacji, która utworzyła ten dokument.

# ApplicationVersion
source: Specifies the version of the application which produced this document.<p/>The content of this element shall be of the form XX.YYYY where X and Y represent numerical values, or the document shall be considered non-conformant.<p/>Note: The contents of this element do not represent absolute values, but rather qualify the contents of the Application element to differentiate between different versions of the same producer. Applications should use this information in an informative manner only (as document metadata).
pl: Określa wersję aplikacji, która wytworzyła ten dokument.<p/>Zawartość tego elementu powinna mieć postać XX.YYYY, gdzie X i Y reprezentują wartości liczbowe, w przeciwnym razie dokument zostanie uznany za niezgodny.<p/>Uwaga: Zawartość tego elementu nie reprezentuje wartości bezwzględnych, ale raczej kwalifikuje zawartość elementu Application w celu rozróżnienia między różnymi wersjami tego samego producenta. Aplikacje powinny wykorzystywać te informacje wyłącznie w sposób informacyjny (jako metadane dokumentu).

# Category
source: Specifies the category of the content that is contained in the document.
pl: Określa kategorię zawartości zawartej w dokumencie.

# Characters
source: Specifies the total number of characters in a document.
pl: Określa łączną liczbę znaków w dokumencie.

# CharactersWithSpaces
source: Specifies the last count of the number of characters (including spaces) in this document.
pl: Określa ostatnią liczbę znaków (łącznie ze spacjami) w tym dokumencie.

# Company
source: Specifies the name of a company associated with the document.
pl: Określa nazwę firmy skojarzonej z dokumentem.

# ContentStatus
source: Example values include "Draft", "Reviewed", and "Final".
pl: Przykładowe wartości to "Wersja robocza", "Przejrzana" i "Ostateczna".

# ContentType
source: Example values include "Whitepaper", "Security Bulletin", and "Exam".<p/>This property is distinct from Multipurpose Internet Mail Extensions (MIME) content types as defined in RFC 2616.
pl: Przykładowe wartości to "Whitepaper", "Security Bulletin" i "Exam".<p/>Ta właściwość różni się od typów zawartości MIME (Multipurpose Internet Mail Extensions) zdefiniowanych w dokumencie RFC 2616.

# Description
source: The description may include but is not limited to: an abstract, table of contents, reference to a graphical representation of content, or a free-text account of the content.
pl: Opis może zawierać między innymi: streszczenie, spis treści, odniesienie do graficznej reprezentacji treści lub dowolne tekstowe wyjaśnienie treści.

# DigitalSignature
source: Contains the signature of a digitally signed document.<p/>Note: This property is a mechanism used by legacy documents to store the digital signature of its binary representation, and should be avoided in favor of the well-defined mechanism defined in Part 2. Any use of this property should be for legacy compatibility only, and is application-defined.
pl: Zawiera podpis dokumentu podpisanego cyfrowo.<p/>Uwaga: Ta właściwość jest mechanizmem używanym przez starsze dokumenty do przechowywania podpisu cyfrowego jego binarnej reprezentacji i należy jej unikać na rzecz dobrze zdefiniowanego mechanizmu zdefiniowanego w części 2. Każde użycie tej właściwości powinno dotyczyć tylko starszej zgodności i jest zdefiniowane przez aplikację.

# HeadingPairs
source: Heading pairs indicates the grouping of document parts and the number of parts in each group. These parts are not document parts but conceptual representations of document sections.
pl: Pary nagłówków wskazują grupowanie części dokumentu i liczbę części w każdej grupie. Te części nie są częściami dokumentu, ale koncepcyjnymi reprezentacjami sekcji dokumentu.

# HyperlinkBase
source: Specifies the base string used for evaluating relative hyperlinks in this document.
pl: Określa ciąg podstawowy używany do obliczania względnych hiperłączy w tym dokumencie.

# HyperlinkList
source: Specifies the set of hyperlinks that were in this document when last saved.
pl: Określa zestaw hiperłączy, które znajdowały się w tym dokumencie w momencie ostatniego zapisu.

# HyperlinksChanged
source: Specifies that one or more hyperlinks in this part were updated exclusively in this part by a producer. The next producer to open this document shall update the hyperlink relationships with the new hyperlinks specified in this part.
pl: Określa, że co najmniej jedno hiperłącze w tej części zostało zaktualizowane wyłącznie w tej części przez producenta. Następny producent, który otworzy ten dokument, zaktualizuje relacje hiperłączy o nowe hiperłącza określone w niniejszej części.

# Identifier
source: A string that identifies this document
pl: Ciąg znaków identyfikujący ten dokument

# Keywords
source: A delimited set of keywords to support searching and indexing the document and content
pl: Rozdzielany zestaw słów kluczowych do obsługi wyszukiwania i indeksowania dokumentu i zawartości

# Language
source: Language of the document content
pl: Język treści dokumentu

# Lines
source: Specifies the total number of lines in a document when last saved by a conforming producer if applicable.
pl: Określa łączną liczbę wierszy w dokumencie po ostatnim zapisaniu przez zgodnego producenta, jeśli ma to zastosowanie.

# LinksUpToDate
source: Indicates whether hyperlinks in a document are up-to-date. Set this element to TRUE to indicate that hyperlinks are updated. Set this element to FALSE to indicate that hyperlinks are outdated.
pl: Wskazuje, czy hiperłącza w dokumencie są aktualne. Ustaw ten element na wartość TRUE, aby wskazać, że hiperłącza są aktualizowane. Ustaw ten element na wartość FALSE, aby wskazać, że hiperłącza są nieaktualne.

# Manager
source: Specifies the name of a supervisor associated with the document.
pl: Określa imię i nazwisko przełożonego skojarzonego z dokumentem.

# Pages
source: Specifies the total number of pages of a document if applicable.
pl: Określa łączną liczbę stron dokumentu, jeśli ma to zastosowanie.

# Paragraphs
source: Specifies the total number of paragraphs found in a document if applicable.
pl: Określa łączną liczbę akapitów znalezionych w dokumencie, jeśli ma to zastosowanie.

# PresentationFormat
source: Specifies the intended format for a presentation document. For example, a presentation intended to be shown on video has PresentationFormat "Video".
pl: Określa zamierzony format dokumentu prezentacji. Na przykład prezentacja przeznaczona do pokazania w klipie wideo ma PresentationFormat "Wideo".

# Revision
source: Indicates the number of changed saves or revisions.<p/>The application is responsible for updating the Revision property value after each revision.
pl: Wskazuje liczbę zmienionych zapisów lub wersji.<p/>Aplikacja jest odpowiedzialna za aktualizację wartości właściwości Zmiana po każdej wersji.

# ScaleCrop
source: Indicates the display mode of the document thumbnail. Set this element to TRUE to enable scaling of the document thumbnail to the display. Set this element to FALSE to enable cropping of the document thumbnail to show only sections that fits the display.
pl: Wskazuje tryb wyświetlania miniatury dokumentu. Ustaw ten element na wartość TRUE, aby umożliwić skalowanie miniatury dokumentu do ekranu. Ustaw ten element na wartość FALSE, aby umożliwić przycinanie miniatury dokumentu w celu wyświetlenia tylko tych sekcji, które pasują do ekranu.

# SharedDocument
source: Indicates if this document is currently shared between multiple producers. If this element is set to TRUE, producers should take care when updating the document.
pl: Wskazuje, czy ten dokument jest obecnie współużytkowany przez wielu producentów. Jeśli ten element jest ustawiony na wartość TRUE, producenci powinni zachować ostrożność podczas aktualizowania dokumentu.

# Template
source: Specifies the name of an external document template containing format and style information used to create the current document.
pl: Określa nazwę zewnętrznego szablonu dokumentu zawierającego informacje o formacie i stylu użytym do utworzenia bieżącego dokumentu.

# TitlesOfParts
source: Specifies the title of each document. These parts are not document parts but conceptual representations of document sections.
pl: Określa tytuł każdego dokumentu. Te części nie są częściami dokumentu, ale koncepcyjnymi reprezentacjami sekcji dokumentu.

# TotalTime
source: Total time that a document has been edited. The default time unit is minutes.
pl: Łączny czas edytowania dokumentu. Domyślną jednostką czasu są minuty.

# Words
source: Specifies the total number of words contained in a document when last saved.
pl: Określa łączną liczbę wyrazów zawartych w dokumencie w momencie ostatniego zapisania.

# Created
source: Automatically set by application.
pl: Automatycznie ustawiane przez aplikację.

# Creator
source: Automatically set by application.
pl: Automatycznie ustawiane przez aplikację.

# DocumentSecurity
source: Specifies the security level of a document as a numeric value. Document security is defined as follows:<p/>1 Document is password protected.<p/>2 Document is recommended to be opened as read-only.<p/>4 Document is enforced to be opened as read-only.<p/>8 Document is locked for annotation.
pl: Określa poziom bezpieczeństwa dokumentu jako wartość liczbową. Bezpieczeństwo dokumentu jest definiowane następująco:<p/>1 Dokument jest chroniony hasłem.<p/>2 Zaleca się otwieranie dokumentu tylko do odczytu.<p/>4 Dokument jest wymuszany do otwierania tylko do odczytu.<p/>8 Dokument jest zablokowany do adnotacji.

# LastModifiedBy
source: Automatically set by application.
pl: Automatycznie ustawiane przez aplikację.

# LastPrinted
source: Automatically set by application.
pl: Automatycznie ustawiane przez aplikację.

# Modified
source: Automatically set by application.
pl: Automatycznie ustawiane przez aplikację.

# MultimediaClips
source: Number of multimedia clips contained in the document
pl: Liczba klipów multimedialnych zawartych w dokumencie

# Version
source: A string that identifies the version of this document
pl: Ciąg znaków identyfikujący wersję tego dokumentu

# Subject
source: A string that identifies the topic of this document
pl: Ciąg znaków identyfikujący temat tego dokumentu

# Title
source: A string that is presented as the title of this document
pl: Ciąg znaków prezentowany jako tytuł tego dokumentu
