Repository: qhta/DocxEditor
Catalog: DocxControls/Resources/SettingsDescriptions.*.resx
Languages: pl

# ActiveWritingStyle
source: Specifies information about the parameters of the grammar checking which was performed on the contents of the current WordprocessingML document. <p/>Note: This information can be used as desired by applications; for example, to determine if the current grammar checking state, specified by the proofState element (§17.15.1.65) is sufficient.
pl: Określa informacje o parametrach sprawdzania gramatyki, które zostało wykonane na zawartości bieżącego dokumentu WordprocessingML. <p/>Uwaga: Te informacje mogą być używane przez aplikacje w różny sposób, na przykład do określenia, czy bieżący stan sprawdzania gramatyki, określony przez element proofState (§17.15.1.65) jest wystarczający.

# AlignBorderAndEdges
source: Specifies that paragraph borders specified using the pBdr element (§17.3.1.24) and table borders using the tblBorders element (§17.4.40) shall be adjusted to align with extents of the page border defined using the pgBorders element (§17.6.10) if the spacing between these borders is less than or equal to 10.5 points (one character width) or less from the page border. The presence of this setting shall ensure there are no gaps of one character width or less between adjoining page and paragraph/table borders, as borders which are perfectly aligning shall not be displayed in favor of the intervening page border.
pl: Określa, że obramowania akapitów określone za pomocą elementu pBdr (§17.3.1.24) i obramowania tabeli za pomocą elementu tblBorders (§17.4.40) powinny zostać dostosowane w celu wyrównania do zakresów obramowania strony zdefiniowanego za pomocą elementu pgBorders (§17.6.10), jeśli odstęp między tymi obramowaniami jest mniejszy lub równy 10,5 punktu (szerokość jednego znaku) lub mniejsza od obramowania strony. Obecność tego ustawienia zapewni, że między sąsiednią stroną a obramowaniem akapitu/tabeli nie będzie przerw o szerokości jednego znaku lub mniejszej, ponieważ obramowania, które są idealnie wyrównane, nie będą wyświetlane na korzyść krawędzi strony znajdującej się między nimi.

# AlwaysMergeEmptyNamespace
source: Specifies whether custom XML markup specified via the customXml element which has no associated namespace shall be treated as an error and moved into a special error namespace (for the purposes of XML schema validation) when the document is opened. If this element is turned on, when an application determines that the current XML markup is in the empty namespace, those elements shall not automatically be moved into an error namespace.
pl: Określa, czy niestandardowy znacznik XML określony za pomocą elementu customXml, który nie ma skojarzonej przestrzeni nazw, powinien być traktowany jako błąd i przenoszony do specjalnej przestrzeni nazw błędów (na potrzeby walidacji schematu XML) po otwarciu dokumentu. Jeśli ten element jest włączony, gdy aplikacja stwierdzi, że bieżący znacznik XML znajduje się w pustej przestrzeni nazw, elementy te nie zostaną automatycznie przeniesione do przestrzeni nazw błędów.

# AlwaysShowPlaceholderText
source: Specifies that each custom XML element specified using the customXml element within this document shall always show some form of in-document placeholder text presentation when it contains no run content. If the placeholder element (§17.5.2.25) is present in the custom XML element's properties, then this is the placeholder text displayed and this effect has no effect. If the placeholder element is omitted, then the application shall use the name of the element to generate default placeholder text in its place.
pl: Określa, że każdy niestandardowy element XML określony za pomocą elementu customXml w tym dokumencie zawsze powinien pokazywać jakąś formę prezentacji tekstu zastępczego w dokumencie, jeśli nie zawiera zawartości uruchamiania. Jeśli element zastępczy (§17.5.2.25) jest obecny we właściwościach niestandardowego elementu XML, oznacza to, że jest to tekst zastępczy i ten efekt nie ma żadnego wpływu. Jeśli element zastępczy zostanie pominięty, aplikacja użyje nazwy elementu do wygenerowania domyślnego tekstu zastępczego w jego miejsce.

# AttachedSchema
source: Specifies that the custom XML schema whose target namespace matches the value specified in the val attribute should be associated with this document when it is loaded, if such a schema is available to the hosting application. Applications can also load and utilize any additional schemas as well as those explicitly mentioned here. <p/>Note: These custom XML schemas can then be used to validate the structure of the custom XML markup in the document, etc.
pl: Określa, że niestandardowy schemat XML, którego docelowa przestrzeń nazw jest zgodna z wartością określoną w atrybucie val, powinien być skojarzony z tym dokumentem podczas ładowania, jeśli taki schemat jest dostępny dla aplikacji hostującej. Aplikacje mogą również ładować i wykorzystywać wszelkie dodatkowe schematy, a także te wyraźnie wymienione w tym miejscu. <p/>Uwaga: Te niestandardowe schematy XML mogą być następnie używane do sprawdzania poprawności struktury niestandardowych znaczników XML w dokumencie itp.

# AttachedTemplate
source: Specifies the location of a document template which shall be attached to the current WordprocessingML document if it is accessible and of a format supported by an application. Specifically, this element's val attribute shall contain the file path of the associated document template.
pl: Określa lokalizację szablonu dokumentu, który powinien być dołączony do bieżącego dokumentu WordprocessingML, jeśli jest dostępny i ma format obsługiwany przez aplikację. W szczególności atrybut val tego elementu powinien zawierać ścieżkę do pliku powiązanego szablonu dokumentu.

# AutoFormatOverride
source: Specifies whether formatting automatically applied by an application (i.e. not explicitly applied by a use or an application) shall be allowed to override formatting protection enabled via the formatting attribute on the documentProtection element (§17.15.1.9) when those formatting operations would add formatting which has been explicitly disabled. <p/>Example: Automatically adding superscript to the st in the string 1st.
pl: Określa, czy formatowanie automatycznie stosowane przez aplikację (tj. niezastosowane jawnie przez użycie lub aplikację) powinno mieć możliwość zastąpienia ochrony formatowania włączonej za pośrednictwem atrybutu formatowania w elemencie documentProtection (§17.15.1.9), gdy te operacje formatowania dodałyby formatowanie, które zostało jawnie wyłączone. <p/>Przykład: Automatyczne dodawanie indeksu górnego do st w ciągu 1st.

# AutoHyphenation
source: Specifies whether the content of a given WordprocessingML document should automatically be hyphenated by the hosting application before it is displayed, if the application supports this functionality.
pl: Określa, czy zawartość danego dokumentu WordprocessingML powinna być automatycznie dzielona wyrazami wyrazów wyrazów przez aplikację hostującą przed jego wyświetleniem, jeśli aplikacja obsługuje tę funkcję.

# BookFoldPrinting
source: Specifies if the contents of a given WordprocessingML document should be printed as signatures. Signatures are printed sheets, which depict several pages of a document that are folded and bound with other signatures to form a booklet, a set of which can be bound together to form a book like publication. Specifically, this element specifies that each page in a given WordprocessingML document should be oriented in a landscape fashion, divided in half vertically with two left margins emanating from the bisector of the page, and two right margins instantiated at the left and right side of each page.
pl: Określa, czy zawartość danego dokumentu WordprocessingML powinna być drukowana jako podpisy. Podpisy to drukowane arkusze, które przedstawiają kilka stron dokumentu, które są składane i oprawiane innymi podpisami w celu utworzenia broszury, której zestaw można związać ze sobą, tworząc publikację przypominającą książkę. W szczególności ten element określa, że każda strona w danym dokumencie WordprocessingML powinna być zorientowana w orientacji poziomej, podzielona na pół w pionie z dwoma lewymi marginesami wychodzącymi z dwusiecznej strony i dwoma prawymi marginesami utworzonymi po lewej i prawej stronie każdej strony.

# BookFoldPrintingSheets
source: This element shall be used in conjunction with the bookFoldPrinting (§17.15.1.11) and bookFoldRevPrinting (§17.15.1.13) elements to specify the number of pages to be included in each booklet when printing a series of signatures. Signatures are printed sheets, which depict several pages of a document that are to be folded and bound with other signatures to form a booklet. Booklets can be bound together to form a book like publication.
pl: Element ten powinien być używany w połączeniu z elementami bookFoldPrinting (§17.15.1.11) i bookFoldRevPrinting (§17.15.1.13) w celu określenia liczby stron, które mają być zawarte w każdej broszurze podczas drukowania serii podpisów. Podpisy to wydrukowane arkusze, które przedstawiają kilka stron dokumentu, które mają być złożone i oprawione innymi podpisami w celu utworzenia broszury. Broszury można oprawić ze sobą, tworząc książkę podobną do publikacji.

# BookFoldReversePrinting
source: Shall be used in conjunction with the bookFoldPrinting (§17.15.1.11) and bookFoldRevPrinting (§17.15.1.13) elements to specify the number of pages to be included in each booklet when printing a series of signatures. Signatures are printed sheets, which depict several pages of a document that are to be folded and bound with other signatures to form a booklet. Booklets can be bound together to form a book like publication.
pl: Powinien być używany w połączeniu z elementami bookFoldPrinting (§17.15.1.11) i bookFoldRevPrinting (§17.15.1.13) w celu określenia liczby stron, które mają być zawarte w każdej broszurze podczas drukowania serii podpisów. Podpisy to wydrukowane arkusze, które przedstawiają kilka stron dokumentu, które mają być złożone i oprawione innymi podpisami w celu utworzenia broszury. Broszury można oprawić ze sobą, tworząc książkę podobną do publikacji.

# BordersDoNotSurroundFooter
source: Specifies that a given WordprocessingML document’s page border specified using the pgBorders element (§17.6.10) should not surround contents of the footer.
pl: Określa, że obramowanie strony danego dokumentu WordprocessingML określone za pomocą elementu pgBorders (§17.6.10) nie powinno otaczać zawartości stopki.

# BordersDoNotSurroundHeader
source: Specifies that a given WordprocessingML document’s page border specified using the pgBorders element (§17.6.10) should not surround contents of the header.
pl: Określa, że obramowanie strony danego dokumentu WordprocessingML określone za pomocą elementu pgBorders (§17.6.10) nie powinno otaczać zawartości nagłówka.

# Captions
source: Specifies the presence of information about captionsin a given WordprocessingML document. This information is divided into two components:<p/>• The child element caption defines the format for a single type of caption to be automatically added to the document.<p/>• The child element autoCaptions defines the types of objects to which a caption format shall automatically be applied.<p/>This information should be used to determine the captions which are automatically added to objects when they are inserted into a WordprocessingML document. <p/>Note: This setting is typically ignored unless it is specified in an application's default template.
pl: Określa obecność informacji o podpisach w danym dokumencie WordprocessingML. Informacje te są podzielone na dwa komponenty:<p/>• Podpis elementu podrzędnego określa format pojedynczego typu podpisu, który ma być automatycznie dodawany do dokumentu.<p/>• Element podrzędny autoCaptions definiuje typy obiektów, do których format napisów ma być automatycznie stosowany.<p/>Te informacje powinny być używane do określania podpisów, które są automatycznie dodawane do obiektów po ich wstawieniu do dokumentu WordprocessingML. <p/>Uwaga: To ustawienie jest zwykle ignorowane, chyba że jest określone w domyślnym szablonie aplikacji.

# CharacterSpacingControl
source: Specifies how full-width characters in the current WordprocessingML document should be compressed to remove additional whitespace when the contents of this document are displayed, specifically by specifying the set(s) of characters which can be compressed to remove additional whitespace. <p/>Note: The behavior of this element is functionally identical to the text-justify-trim property.
pl: Określa, w jaki sposób znaki o pełnej szerokości w bieżącym dokumencie WordprocessingML powinny być kompresowane w celu usunięcia dodatkowych białych znaków podczas wyświetlania zawartości tego dokumentu, w szczególności przez określenie zestawów znaków, które można skompresować w celu usunięcia dodatkowych białych znaków. <p/>Uwaga: Zachowanie tego elementu jest funkcjonalnie identyczne z właściwością text-justify-trim .

# ChartTrackingRefBased
source: Specifies how the datapoint properties and datalabels in all charts in this document behave. The meaning of the setting is as follows:<p/>True Datapoint properties and datalabels in all charts in this document follow their reference.<p/>False Datapoint properties and datalabels in all charts in this document follow their position in the chart.
pl: Określa sposób zachowania właściwości punktu danych i etykiet danych na wszystkich wykresach w tym dokumencie. Znaczenie tego ustawienia jest następujące:<p/>True Właściwości punktów danych i etykiety danych na wszystkich wykresach w tym dokumencie są zgodne z ich odwołaniem.<p/>False Właściwości punktów danych i etykiety danych na wszystkich wykresach w tym dokumencie są zgodne z ich położeniem na wykresie.

# ClickAndTypeStyle
source: Specifies the paragraph style, specified using the style element, which shall be applied to paragraphs which are automatically created when text is inserted into a WordprocessingML document in an area of the document that has no other style associated with it. This style is referenced via the val attribute, which stores the style ID of the style (stored in the styleId attribute on the style definition).
pl: Określa styl akapitu, określony za pomocą elementu style, który ma być stosowany do akapitów tworzonych automatycznie po wstawieniu tekstu do dokumentu WordprocessingML w obszarze dokumentu, z którym nie jest skojarzony żaden inny styl. Do tego stylu odwołuje się atrybut val, który przechowuje identyfikator stylu (przechowywany w atrybucie styleId w definicji stylu).

# ColorSchemeMapping
source: Specifies the theme color, stored in the document's Theme part to which the value of this theme color shall be mapped. This mapping enables multiple theme colors to be chained together.
pl: Określa kolor motywu przechowywany w części Motyw dokumentu, do której ma być odwzorowana wartość tego koloru motywu. To mapowanie umożliwia łączenie ze sobą wielu kolorów motywu.

# Compatibility
source: Specifies a set of optional compatibility options for the current document.
pl: Określa zestaw opcjonalnych opcji zgodności dla bieżącego dokumentu.

# ConflictMode
source: When true, specifies that the user was resolving conflicting edits when the document was saved.
pl: W przypadku wartości true określa, że użytkownik rozwiązywał problemy ze zmianami w momencie zapisywania dokumentu.

# ConsecutiveHyphenLimit
source: Specifies the maximum number of consecutive lines of text that can end with a hyphen when the contents of this document are displayed. Once this limit has been reached, the following line shall not be hyphenated regardless of whether or not it meets the criteria needed for hyphenation.
pl: Określa maksymalną liczbę kolejnych wierszy tekstu, które mogą kończyć się łącznikiem podczas wyświetlania zawartości tego dokumentu. Po osiągnięciu tego limitu następujący wiersz nie może być dzielony wyrazami, niezależnie od tego, czy spełnia kryteria niezbędne do dzielenia wyrazów.

# DecimalSymbol
source: Specifies the character that shall be interpreted as the radix point when evaluating the contents of all fields in the current document.<p/>Rationale: When evaluating field instructions based on the contents of the current document, it is necessary to know the character which must be treated as the radix point in order to prevent changes to the calculation of the same field instructions based on the current user's locale. This element stores the radix point which must be used to evaluate fields in the contents of this document, irrespective of the locale of the application loading the file.
pl: Określa znak, który ma być interpretowany jako punkt podstawy podczas oceniania zawartości wszystkich pól w bieżącym dokumencie.<p/>Uzasadnienie: Podczas oceniania instrukcji polowych na podstawie zawartości bieżącego dokumentu, konieczna jest znajomość znaku, który musi być traktowany jako punkt podstawy, aby zapobiec zmianom w obliczeniach tych samych instrukcji pola na podstawie ustawień regionalnych bieżącego użytkownika. Ten element przechowuje punkt podstawy, który musi być używany do oceny pól w zawartości tego dokumentu, niezależnie od ustawień regionalnych aplikacji ładującej plik.

# DefaultImageDpi
source: Specifies the resolution in dots per inch (DPI) at which images in the document will be saved.<p/>This setting is ignored by images that have dots per inch (DPI) specified by useLocalDpi. This setting is also ignored when doNotAutoCompressPictures is set to "true".
pl: Określa rozdzielczość w punktach na cal (DPI), z jaką będą zapisywane obrazy w dokumencie.<p/>To ustawienie jest ignorowane przez obrazy, które mają punkty na cal (DPI) określone przez useLocalDpi. To ustawienie jest również ignorowane, gdy parametr doNotAutoCompressPictures jest ustawiony na wartość "true".

# DefaultTableStyle
source: Specifies the table style which shall automatically be applied to the table properties of tables added to this document by an application. Note that it does not change the table style applied to tables which do not reference a style, instead, it automatically applies the style to that table via the tblStyle element (§17.4.63). This link is made by referencing the styleId attribute value of the table style which shall be used to format newly inserted tables.
pl: Określa styl tabeli, który ma być automatycznie stosowany do właściwości tabel dodanych do tego dokumentu przez aplikację. Należy zauważyć, że nie zmienia stylu tabeli zastosowanego do tabel, które nie odwołują się do stylu, zamiast tego automatycznie stosuje styl do tej tabeli za pośrednictwem elementu tblStyle (§17.4.63). To łącze jest tworzone przez odwołanie się do wartości atrybutu styleId stylu tabeli, który powinien być używany do formatowania nowo wstawionych tabel.

# DefaultTabStop
source: Specifies the value which shall be used as the multiplier to generate automatic tab stops in this document. Automatic tab stops refer to the tab stop locations which occur after all custom tab stops in the current paragraph have been surpassed.
pl: Określa wartość, która ma być używana jako mnożnik do generowania automatycznych tabulatorów w tym dokumencie. Tabulatory automatyczne odnoszą się do lokalizacji tabulatorów, które występują po przekroczeniu wszystkich niestandardowych tabulatorów w bieżącym akapicie.

# DiscardImageEditingData
source: When true, specifies that the cropped-out areas of the images are not to be saved. Rather, the images saved are the results of applying imgProps on the original images. <p/>If this element is absent or if it has a value of "false", the cropped-out areas of images are saved.
pl: W przypadku wartości true określa, że przycięte obszary obrazów nie mają być zapisywane. Zapisane obrazy są raczej wynikiem zastosowania imgProps na oryginalnych obrazach. <p/>Jeśli ten element jest nieobecny lub ma wartość "false", przycięte obszary obrazów są zapisywane.

# DisplayBackgroundShape
source: Specifies whether the images and colors defined in the document's background using the background element (§17.2.1) shall be displayed when the document is displayed in print layout view as specified in the view element (§17.15.1.92).
pl: Określa, czy obrazy i kolory zdefiniowane w tle dokumentu za pomocą elementu tła (§17.2.1) mają być wyświetlane, gdy dokument jest wyświetlany w widoku układu wydruku, jak określono w elemencie widoku (§17.15.1.92).

# DisplayHorizontalDrawingGrid
source: Specifies the number of horizontal grid units defined using the drawingGridHorizontalSpacing element (§17.15.1.45) which shall be allowed between subsequent visible horizontal drawing grid lines in this document, if gridlines are being shown. <p/>Note: The display of gridlines is an application-level setting not specified in IEEE/IEC 29500. The drawing grid is a grid which can be used by applications to help position floating objects in the document.
pl: Określa liczbę jednostek siatki poziomej zdefiniowanych za pomocą elementu drawingGridHorizontalSpacing (§17.15.1.45), która powinna być dozwolona między kolejnymi widocznymi liniami siatki poziomej w tym dokumencie, jeśli są wyświetlane linie siatki. <p/>Uwaga: Wyświetlanie linii siatki jest ustawieniem na poziomie aplikacji, które nie zostało określone w normie IEEE/IEC 29500. Siatka rysunku to siatka, która może być używana przez aplikacje do określania położenia obiektów przestawnych w dokumencie.

# DisplayVerticalDrawingGrid
source: Specifies the number of vertical grid units defined using the drawingGridVerticalSpacing element (§17.15.1.47) which shall be allowed between subsequent vertical gridlines in this document, if gridlines are being shown. <p/>Note: The display of gridlines is an application-level setting not specified in IEEE/IEC 29500. The drawing grid is a grid which can be used by applications to help position floating objects in the document.
pl: Określa liczbę pionowych jednostek siatki zdefiniowanych za pomocą elementu drawingGridVerticalSpacing (§17.15.1.47), które powinny być dozwolone między kolejnymi pionowymi liniami siatki w tym dokumencie, jeśli są wyświetlane linie siatki. <p/>Uwaga: Wyświetlanie linii siatki jest ustawieniem na poziomie aplikacji, które nie zostało określone w normie IEEE/IEC 29500. Siatka rysunku to siatka, która może być używana przez aplikacje do określania położenia obiektów przestawnych w dokumencie.

# DocumentId
source: Specifies an arbitrary identifier for the context of the paragraph identifiers in the document. Values MUST be greater than 0 and less than 0x80000000.
pl: Określa dowolny identyfikator dla kontekstu identyfikatorów akapitów w dokumencie. Wartości MUSZĄ być większe niż 0 i mniejsze niż 0x80000000.
