Repository: qhta/DocxEditor
Catalog: DocxControls/Resources/SettingsTooltips.*.resx
Languages: pl

# ActiveWritingStyle
source: Grammar checking settings
pl: Ustawienia sprawdzania gramatyki

# AlignBorderAndEdges
source: Align paragraph and table borders with page border
pl: Wyrównywanie obramowań akapitu i tabeli do obramowania strony

# AlwaysMergeEmptyNamespace
source: Do not mark custom XML elements with no namespace as invalid
pl: Nie oznaczaj niestandardowych elementów XML bez przestrzeni nazw jako nieprawidłowych

# AlwaysShowPlaceholderText
source: Use custom XML element names as default placeholder text
pl: Używanie niestandardowych nazw elementów XML jako domyślnego tekstu zastępczego

# AttachedSchema
source: Attached custom XML schema
pl: Dołączony niestandardowy schemat XML

# AttachedTemplate
source: Attached document template
pl: Załączony szablon dokumentu

# AutoFormatOverride
source: Allow automatic formatting to override formatting protection settings
pl: Zezwalaj na zastępowanie ustawień ochrony formatowania automatycznego formatowania

# AutoHyphenation
source: Automatically hyphenate document contents when displayed
pl: Automatyczne dzielenie wyrazów zawartości dokumentu przy wyświetlaniu

source: Book fold printing
pl: Drukowanie przy składaniu książek

# BookFoldPrintingSheets
source: Number of pages per booklet
pl: Liczba stron w broszurze

# BookFoldReversePrinting
source: Reverse book fold printing
pl: Drukowanie odwróconego składania książek

# BordersDoNotSurroundFooter
source: Page border excludes footer
pl: Obramowanie strony nie obejmuje stopki

# BordersDoNotSurroundHeader
source: Page border excludes header
pl: Obramowanie strony nie obejmuje nagłówka

# Captions
source: Caption settings
pl: Ustawienia napisów

# CharacterSpacingControl
source: Character-level whitespace compression
pl: Kompresja białych znaków na poziomie znaku

# ChartTrackingRefBased
source: Datapoint properties and datalabels behavior
pl: Właściwości punktu danych i zachowanie etykiet danych

# ClickAndTypeStyle
source: Paragraph style applied to automatically generated paragraphs
pl: Styl akapitu zastosowany do akapitów generowanych automatycznie

# ColorSchemeMapping
source: Theme color mappings
pl: Mapowania kolorów motywu

# Compatibility
source: Compatibility settings
pl: Ustawienia zgodności

# ConflictMode
source: User was resolving conflicting edits when the document was saved
pl: Użytkownik usuwał zmiany powodujące konflikt podczas zapisywania dokumentu

# ConsecutiveHyphenLimit
source: Maximum number of consecutively hyphenated lines
pl: Maksymalna liczba kolejno podzielonych wierszy

# DecimalSymbol
source: Radix point for field code evaluation
pl: Punkt podstawy do oceny kodu pola

# DefaultImageDpi
source: Resolution in dots per inch (DPI) at which images in the document will be saved
pl: Rozdzielczość w punktach na cal (DPI), z jaką zostaną zapisane obrazy w dokumencie

# DefaultTableStyle
source: Default table style for newly inserted tables
pl: Domyślny styl tabeli dla nowo wstawionych tabel

# DefaultTabStop
source: Distance between automatic tab stops
pl: Odległość między automatycznymi zakładkami

# DiscardImageEditingData
source: Cropped-out areas of the images are not to be saved
pl: Przycięte obszary obrazów nie mogą być zapisywane

# DisplayBackgroundShape
source: Display background objects when displaying document
pl: Wyświetlanie obiektów tła podczas wyświetlania dokumentu

# DisplayHorizontalDrawingGrid
source: Distance between horizontal gridlines
pl: Odległość między poziomymi liniami siatki

# DisplayVerticalDrawingGrid
source: Distance between vertical gridlines
pl: Odległość między pionowymi liniami siatki

# DocumentId
source: Arbitrary identifier for the context of the paragraph identifiers in the document
pl: Dowolny identyfikator dla kontekstu identyfikatorów akapitów w dokumencie

# DocumentProtection
source: Document editing restrictions
pl: Ograniczenia edycji dokumentu

# DocumentType
source: Document classification
pl: Klasyfikacja dokumentów

source: Document variables
pl: Zmienne dokumentu

# DoNotAutoCompressPictures
source: Do not automatically compress images
pl: Nie kompresuj obrazów automatycznie

# DoNotDemarcateInvalidXml
source: Do not show visual indicator for invalid custom XML markup
pl: Nie pokazuj wizualnego wskaźnika dla nieprawidłowych niestandardowych znaczników XML

# DoNotDisplayPageBoundaries
source: Do not display visual boundary for header/footer or between pages
pl: Nie wyświetlaj wizualnej granicy nagłówka/stopki ani między stronami

# DoNotHyphenateCaps
source: Do not hyphenate words in all capital letters
pl: Nie dziel wyrazów wielkimi literami

# DoNotIncludeSubdocsInStats
source: Do not include content in text boxes, footnotes, and endnotes in document statistics
pl: Nie uwzględniaj zawartości pól tekstowych, przypisów dolnych i końcowych w statystykach dokumentu

# DoNotShadeFormData
source: Do not show visual indicator for form fields
pl: Nie pokazuj wskaźnika wizualnego dla pól formularza

# DoNotTrackFormatting
source: Do not track formatting revisions when tracking revisions
pl: Nie śledź poprawek formatowania podczas śledzenia poprawek

# DoNotTrackMoves
source: Do not use move syntax when tracking revisions
pl: Nie używaj składni przenoszenia podczas śledzenia poprawek

source: Do not use margins for drawing grid origin
pl: Nie używaj marginesów do rysowania początku siatki

# DoNotValidateAgainstSchema
source: Do not validate custom XML markup against schemas
pl: Nie weryfikuj niestandardowych znaczników XML względem schematów

# DrawingGridHorizontalOrigin
source: Drawing grid horizontal origin point
pl: Poziomy punkt początkowy siatki rysunku

# DrawingGridHorizontalSpacing
source: Drawing grid horizontal grid unit size
pl: Rozmiar jednostki siatki poziomej siatki rysunku

# DrawingGridVerticalOrigin
source: Drawing grid vertical origin point
pl: Pionowy punkt początkowy siatki rysunku

# DrawingGridVerticalSpacing
source: Drawing grid vertical grid unit size
pl: Rozmiar jednostki siatki rysunkowej w pionie

# EmbedSystemFonts
source: Embed common system fonts
pl: Osadzanie typowych czcionek systemowych

source: Embed truetype fonts
pl: Osadzanie czcionek truetype

# EndnoteDocumentWideProperties
source: Document-wide endnote properties
pl: Właściwości przypisu końcowego dla całego dokumentu

# EvenAndOddHeaders
source: Different even/odd page headers and footers
pl: Różne parzyste/nieparzyste nagłówki i stopki stron

# FootnoteDocumentWideProperties
source: Document-wide footnote properties
pl: Właściwości przypisu dolnego dla całego dokumentu

# ForceUpgrade
source: Upgrade document on open
pl: Uaktualnij dokument po otwarciu

# FormsDesign
source: Structured document tag placeholder text should be resaved
pl: Tekst zastępczy znacznika dokumentu strukturalnego powinien zostać ponownie zapisany

# GutterAtTop
source: Position gutter at top of page
pl: Umieść margines na oprawę u góry strony

# HeaderShapeDefaults
source: Default parameters for object using the VML syntax inserted in the header and footer
pl: Domyślne parametry obiektu korzystającego ze składni VML wstawionej w nagłówku i stopce

# HideGrammaticalErrors
source: Do not display visual indication of grammatical errors
pl: Nie wyświetlaj wizualnego wskazania błędów gramatycznych

# HideSpellingErrors
source: Do not display visual indication of spelling errors
pl: Nie wyświetlaj wizualnego wskazania błędów ortograficznych

source: Hyphenation zone
pl: Strefa dzielenia wyrazów

# IgnoreMixedContent
source: Ignore mixed content when validating custom XML markup
pl: Ignoruj zawartość mieszaną podczas sprawdzania poprawności niestandardowych znaczników XML

# LinkStyles
source: Automatically update styles from document template
pl: Automatyczne aktualizowanie stylów z szablonu dokumentu

# ListSeparator
source: List separator for field code evaluation
pl: Separator listy do oceny kodu pola

# MailMerge
source: Mail merge settings
pl: Ustawienia korespondencji seryjnej

source: Math properties
pl: Właściwości matematyczne

# MirrorMargins
source: Mirror page margins
pl: Odbicie lustrzane marginesów strony

# NoLineBreaksAfterKinsoku
source: Custom set of characters which cannot end a line
pl: Niestandardowy zestaw znaków, który nie może kończyć wiersza

# NoLineBreaksBeforeKinsoku
source: Custom set of characters which cannot begin a line
pl: Niestandardowy zestaw znaków, który nie może rozpoczynać wiersza

# NoPunctuationKerning
source: Never kern punctuation characters
pl: Znaki interpunkcyjne nigdy nie kernowane

# PersistentDocumentId
source: Unique identifier for a set of documents derived from a common source
pl: Niepowtarzalny identyfikator zestawu dokumentów pochodzących ze wspólnego źródła

# PrintFormsData
source: Only print form field content
pl: Drukuj tylko zawartość pola formularza

# PrintFractionalCharacterWidth
source: Print fractional character widths
pl: Drukowanie szerokości znaków ułamkowych

# PrintPostScriptOverText
source: Print postscript codes with document text
pl: Drukowanie kodów postscript z tekstem dokumentu

# PrintTwoOnOne
source: Print two pages per sheet
pl: Drukowanie dwóch stron na arkuszu

# ProofState
source: Spelling and grammatical checking state
pl: Sprawdzanie pisowni i gramatyki

# ReadModeInkLockDown
source: Freeze document layout
pl: Blokowanie układu dokumentu

# RemoveDateAndTime
source: Remove date and time from annotations
pl: Usuwanie daty i godziny z adnotacji

# RemovePersonalInformation
source: Remove personal information from document properties
pl: Usuwanie informacji osobistych z właściwości dokumentu

# RevisionView
source: Visibility of annotation types
pl: Widoczność typów adnotacji

# Rsids
source: Listing of all revision save id values
pl: Lista wszystkich wartości identyfikatorów zapisu wersji

# SaveFormsData
source: Only save form field content
pl: Zapisuj tylko zawartość pola formularza

# SaveInvalidXml
source: Allow saving document as XML file when custom XML markup is invalid
pl: Zezwalaj na zapisywanie dokumentu jako pliku XML, gdy niestandardowe znaczniki XML są nieprawidłowe

# SavePreviewPicture
source: Generate thumbnail for document on save
pl: Wygeneruj miniaturę dokumentu przy zapisywaniu

# SaveSubsetFonts
source: Subset fonts when embedding
pl: Podzbiór czcionek podczas osadzania

# SaveThroughXslt
source: Custom XSL transform to use when saving as XML file
pl: Niestandardowe przekształcenie XSL do użycia podczas zapisywania jako pliku XML

# SaveXmlDataOnly
source: Only save custom XML markup
pl: Zapisuj tylko niestandardowe znaczniki XML

# SchemaLibrary
source: Embedded custom XML schema supplementary data
pl: Osadzone niestandardowe dane uzupełniające schematu XML

# ShapeDefaults
source: Default parameters for object using the VML syntax inserted in the body
pl: Domyślne parametry obiektu korzystającego ze składni VML wstawionej w treści

# ShowEnvelope
source: Show e-mail message header
pl: Pokaż nagłówek wiadomości e-mail

# ShowXmlTags
source: Show visual indicators for custom XML markup start/end locations
pl: Pokazywanie wskaźników wizualnych dla niestandardowych lokalizacji początkowych/końcowych znaczników XML

# StrictFirstAndLastChars
source: Use strict kinsoku rules for japanese text
pl: Używanie ścisłych reguł kinsoku dla tekstu japońskiego

# StyleLockStylesPart
source: Prevent replacement of styles part
pl: Blokada definicji styli

# StyleLockThemesPart
source: Prevent modification of themes part
pl: Blokada definicji motywu

# StylePaneFormatFilter
source: Suggested filtering for list of document styles
pl: Sugerowane filtrowanie listy stylów dokumentu

# StylePaneSortMethods
source: Suggested sorting for list of document styles
pl: Sugerowane sortowanie dla listy stylów dokumentu

# SummaryLength
source: Percentage of document to use when generating summary
pl: Procent dokumentu do użycia podczas generowania podsumowania

source: Theme font languages
pl: Języki czcionek motywu

# TrackRevisions
source: Track revisions to document
pl: Śledzenie poprawek w dokumencie

# UICompatibleWith97To2003
source: User interface compatible with old Word versions
pl: Interfejs użytkownika kompatybilny ze starszymi wersjami Worda

# UpdateFieldsOnOpen
source: Automatically recalculate fields on open
pl: Automatyczne ponowne obliczanie pól przy otwieraniu

# UseXsltWhenSaving
source: Save document as XML file through custom XSL transform
pl: Zapisz dokument jako plik XML za pomocą niestandardowego przekształcenia XSL

# View
source: Document view setting
pl: Ustawienia widoku dokumentu

source: Write protection
pl: Ochrona przed zapisem

# Zoom
source: Magnification setting
pl: Ustawienie powiększenia
