Repository: qhta/DocxEditor
Catalog: DocxControls/Resources/SettingsDescriptions.*.resx
Languages: pl

# SaveInvalidXml
source: Specifies that this document should be capable of being saved into a format consisting of a single XML file (not defined by IEEE/IEC 29500) when its contents are invalid based XML schema validation of the custom XML markup contained in the document. This setting has no effect on documents that do not contain custom XML markup, or that do contain custom XML markup but do not have a schema attached. <p/>Guidance: Because this setting specifies behavior when saving to an alternative file format not defined by IEEE/IEC 29500, this behavior is optional. <p/>If this element is omitted, then applications should not allow this document to be saved into a single XML file when its contents are invalid based on the custom XML markup contained in the document. If the doNotValidateAgainstSchema element (§17.15.1.43) is set, then the XML is never "invalid" and this property is ignored.
pl: Określa, że powinno być możliwe zapisanie tego dokumentu w formacie składającym się z pojedynczego pliku XML (niezdefiniowanego przez IEEE/IEC 29500), gdy jego zawartość jest nieprawidłowa na podstawie walidacji schematu XML niestandardowego znacznika XML zawartego w dokumencie. To ustawienie nie ma wpływu na dokumenty, które nie zawierają niestandardowych znaczników XML lub zawierają niestandardowe znaczniki XML, ale nie mają dołączonego schematu. <p/>Wskazówka: Ponieważ to ustawienie określa zachowanie podczas zapisywania w alternatywnym formacie pliku, który nie został zdefiniowany przez IEEE/IEC 29500, to zachowanie jest opcjonalne.<p/>Jeśli ten element zostanie pominięty, aplikacje nie powinny zezwalać na zapisanie tego dokumentu w pojedynczym pliku XML, jeśli jego zawartość jest nieprawidłowa na podstawie niestandardowego znacznika XML zawartego w dokumencie. Jeśli element doNotValidateAgainstSchema (§17.15.1.43) jest ustawiony, kod XML nigdy nie jest "nieprawidłowy" i ta właściwość jest ignorowana.

# SavePreviewPicture
source: Specifies if a document's Thumbnail part should be generated for the contents of the first page of this document when saved by application which support document thumbnail generation.<p/>If this element is omitted, then applications can choose to save a thumbnail, however, that behavior is not required. If this element is specified, a thumbnail shall be produced if that functionality is supported.
pl: Określa, czy część miniatury dokumentu powinna być generowana dla zawartości pierwszej strony tego dokumentu po zapisaniu przez aplikację obsługującą generowanie miniatur dokumentów.<p/>Jeśli ten element zostanie pominięty, aplikacje mogą zdecydować się na zapisanie miniatury, jednak takie zachowanie nie jest wymagane. Jeżeli ten element jest określony, tworzona jest miniatura, jeżeli ta funkcja jest obsługiwana.

# SaveSubsetFonts
source: Specifies that applications shall subset fonts when font embedding is enabled for this document using the embedTrueTypeFonts element (§17.8.3.8). Subsetting is a mechanism by which only the glyphs used in the contents of this WordprocessingML document are stored in an embedded font, in order to prevent the file from becoming unnecessarily large from the use of a small number of glyphs from a large embedded font.<p/>If this element is omitted, then the set of fonts should not be subsetted in the current document when font embedded is turned on. If the embedTrueTypeFonts element is omitted or false, then this setting has no effect.
pl: Określa, że aplikacje powinny tworzyć podzbiór czcionek, gdy dla tego dokumentu jest włączone osadzanie czcionek przy użyciu elementu embedTrueTypeFonts (§17.8.3.8). Podzbiór to mechanizm, w którym tylko glify używane w zawartości tego dokumentu WordprocessingML są przechowywane w czcionce osadzonej, aby zapobiec niepotrzebnemu powiększaniu pliku w wyniku użycia niewielkiej liczby glifów z dużej czcionki osadzonej.<p/>Jeśli ten element zostanie pominięty, zestaw czcionek nie powinien być podzbiorem w bieżącym dokumencie, gdy włączona jest czcionka osadzona. Jeśli element embedTrueTypeFonts zostanie pominięty lub będzie fałszywy, to ustawienie nie będzie miało żadnego wpływu.

# SaveThroughXslt
source: Specifies the location of a custom XSL transform which shall be used when this document is saved as a single XML file (in a format not defined by IEEE/IEC 29500). <p/>Guidance: Because this setting specifies behavior when saving to an alternative file format not defined by IEEE/IEC 29500, this behavior is optional.
pl: Określa lokalizację niestandardowego przekształcenia XSL, które ma być używane, gdy ten dokument jest zapisywany jako pojedynczy plik XML (w formacie niezdefiniowanym przez IEEE/IEC 29500). <p/>Wskazówka: Ponieważ to ustawienie określa zachowanie podczas zapisywania w alternatywnym formacie pliku, który nie został zdefiniowany przez IEEE/IEC 29500, to zachowanie jest opcjonalne.

# SaveXmlDataOnly
source: Specifies that the contents of this document shall be saved as an XML file containing only the custom XML markup in this document in its regular form. The resulting document does not conform to IEEE/IEC 29500 (i.e. this is an export-only save option for a WordprocessingML document).<p/>Rationale: This setting is typically used to extract custom XML markup from a WordprocessingML document for further processing by XML-enabled applications.
pl: Określa, że zawartość tego dokumentu zostanie zapisana jako plik XML zawierający tylko niestandardowe znaczniki XML w tym dokumencie w jego zwykłej formie. Wynikowy dokument nie jest zgodny z normą IEEE/IEC 29500 (tj. jest to opcja zapisywania tylko do eksportu dla dokumentu WordprocessingML).<p/>Uzasadnienie: To ustawienie jest zwykle używane do wyodrębniania niestandardowych znaczników XML z dokumentu WordprocessingML w celu dalszego przetwarzania przez aplikacje obsługujące XML.

# SchemaLibrary
source: Specifies the set of XML namespaces which have been associated with the contents of the custom XML markup within the current Office Open XML document. Each unique namespace which is referenced within the document can be referenced within this element by a single schema element, regardless of the number of constituent XML schemas which comprise that namespace.
pl: Określa zestaw przestrzeni nazw XML, które zostały skojarzone z zawartością niestandardowych znaczników XML w bieżącym dokumencie Office Open XML. Do każdej unikatowej przestrzeni nazw, do której odwołuje się dokument, można odwoływać się w tym elemencie za pomocą pojedynczego elementu schematu, niezależnie od liczby składowych schematów XML, które składają się na tę przestrzeń nazw.

# ShapeDefaults
source: Specifies the default parameters for object using the VML syntax (§14.1) inserted in the body (the main document story, comments, footnotes, and endnotes) of the WordprocessingML document. The definition and semantics of these parameters is described in the VML - Office Drawing subclause (§14.2) of IEEE/IEC 29500.
pl: Określa domyślne parametry obiektu przy użyciu składni VML (§14.1) wstawionej w treści (główny wątek dokumentu, komentarze, przypisy dolne i końcowe) dokumentu WordprocessingML. Definicja i semantyka tych parametrów jest opisana w podpunkcie VML - Office Drawing (§14.2) normy IEEE/IEC 29500.

# ShowEnvelope
source: Specifies that an e-mail message header shall be displayed when this document is opened, if an e-mail header is supported by the application opening the file.
pl: Określa, że nagłówek wiadomości e-mail ma być wyświetlany po otwarciu tego dokumentu, jeśli nagłówek wiadomości e-mail jest obsługiwany przez aplikację otwierającą plik.

# ShowXmlTags
source: Specifies that some visual indicator shall be provided for the start and end locations of custom XML markup present in this document, if any.
pl: Określa, że należy zapewnić pewien wskaźnik wizualny dla lokalizacji początkowej i końcowej niestandardowych znaczników XML obecnych w tym dokumencie, jeśli takie istnieją.

# StrictFirstAndLastChars
source: Specifies that the strict set of Kinsoku rules shall be applied to Japanese text in this document when the kinsoku element (§17.3.1.16) is applied to that text. The resulting line breaking rules are provided on the kinsoku element.
pl: Określa, że ścisły zestaw reguł kinsoku ma być stosowany do tekstu japońskiego w tym dokumencie, gdy element kinsoku (§17.3.1.16) jest stosowany do tego tekstu. Wynikowe reguły łamania wierszy są dostępne w elemencie kinsoku.

# StyleLockStylesPart
source: Specifies whether applications shall prevent the replacement of the complete set of styles stored in the Styles part when editing this document. This setting should not preclude the editing or removal of individual styles, instead, it should only prevent the removal and replacement of the entire styles part in a single operation (either through a user interface or a programmatic operation).
pl: Określa, czy aplikacje powinny uniemożliwiać zastąpienie całego zestawu stylów przechowywanych w części Style podczas edycji tego dokumentu. To ustawienie nie powinno wykluczać edycji lub usuwania poszczególnych stylów, a jedynie uniemożliwiać usuwanie i zastępowanie całej części stylów w jednej operacji (za pomocą interfejsu użytkownika lub operacji programowej).

# StyleLockThemesPart
source: Specifies whether applications shall prevent the modification of the document's theme information stored in the Theme part when editing this document. This setting should not preclude the use of the theme information, instead, it should only prevent the modification of the theme part in a single operation (either through a user interface or a programmatic operation).
pl: Określa, czy aplikacje mają uniemożliwiać modyfikację informacji o motywie dokumentu przechowywanych w części Motyw podczas edycji tego dokumentu. To ustawienie nie powinno wykluczać korzystania z informacji o motywie, zamiast tego powinno uniemożliwiać modyfikację części motywu w pojedynczej operacji (za pomocą interfejsu użytkownika lub operacji programowej).

# StylePaneFormatFilter
source: Specifies a sorting which should be applied to the list of styles in this document if the styles are displayed in a user interface.
pl: Określa sortowanie, które powinno być stosowane do listy stylów w tym dokumencie, jeśli style są wyświetlane w interfejsie użytkownika.

# StylePaneSortMethods
source: Specifies a sorting which should be applied to the list of styles in this document if the styles are displayed in a user interface.
pl: Określa sortowanie, które powinno być stosowane do listy stylów w tym dokumencie, jeśli style są wyświetlane w interfejsie użytkownika.

# SummaryLength
source: Specifies the size for automatic document summaries performed on the content of a WordprocessingML document. An automatic document summary is a subset of text contained in a document deemed by the hosting application to summarize the content of the WordprocessingML document. The val attribute of this element specifies the size of an automatic document summary to be performed on a given WordprocessingML document as a percentage of the total size of the given WordprocessingML document. Performing an automatic document summary is a runtime operation outside the scope of IEEE/IEC 29500.
pl: Określa rozmiar automatycznych podsumowań dokumentów wykonywanych na zawartości dokumentu WordprocessingML. Automatyczne podsumowanie dokumentu to podzbiór tekstu zawartego w dokumencie uznanym przez aplikację hostującą za podsumowujący zawartość dokumentu WordprocessingML. Atrybut val tego elementu określa rozmiar automatycznego podsumowania dokumentu, które ma zostać wykonane na danym dokumencie WordprocessingML jako procent całkowitego rozmiaru danego dokumentu WordprocessingML. Wykonywanie automatycznego podsumowania dokumentu jest operacją wykonawczą wykraczającą poza zakres normy IEEE/IEC 29500.

# ThemeFontLanguages
source: Specifies the language which shall be used to determine the appropriate theme fonts in the document's Theme part which map to the major/minor theme fonts. Specifically, the bidi attribute is used to determine the theme font applied to complex script text, the eastAsia attribute is used to determine the theme font applied to East Asian text, and the val attribute is used to determine the theme font applied to all other text.
pl: Określa język, który ma być używany do określania odpowiednich czcionek motywu w części Motyw dokumentu, które są odwzorowywane na czcionki motywu głównego/pomocniczego. W szczególności atrybut bidi służy do określania czcionki motywu zastosowanej do złożonego tekstu skryptu, atrybut eastAsia służy do określania czcionki motywu zastosowanej do tekstu wschodnioazjatyckiego, a atrybut val służy do określania czcionki motywu zastosowanej do całego innego tekstu.

# TrackRevisions
source: Specifies that applications shall track revisions made to the WordprocessingML document. Revisions are changes to a WordprocessingML document which are recorded such that they can be viewed independently, accepted or removed, and reverted if needed. When revisions are tracked, the resulting WordprocessingML markup in the Revisions subclause of this document describes the necessary syntax.
pl: Określa, że aplikacje powinny śledzić poprawki wprowadzone w dokumencie WordprocessingML. Poprawki to zmiany w dokumencie WordprocessingML, które są rejestrowane w taki sposób, że można je przeglądać niezależnie, akceptować lub usuwać i w razie potrzeby przywracać. Gdy poprawki są śledzone, wynikowy znacznik WordprocessingML w podpunkcie Wersje tego dokumentu opisuje niezbędną składnię.

# UICompatibleWith97To2003
source: Disables features incompatible with earlier word processing formats.
pl: Wyłącza funkcje niezgodne z wcześniejszymi formatami edytora tekstu.

# UpdateFieldsOnOpen
source: Specifies whether the fields contained in this document should automatically have their field result recalculated from the field codes when this document is opened by an application which supports field calculations. <p/>Note: Some fields are always recalculated (e.g. the page numbering), therefore this element only affects fields which are typically not automatically recalculated on opening the document. Also note that this setting must not supersede any document protection (§17.15.1.29) or write protection (§17.15.1.93) settings.
pl: Określa, czy wyniki pól zawartych w tym dokumencie powinny być automatycznie przeliczane na podstawie kodów pól, gdy ten dokument jest otwierany przez aplikację obsługującą obliczenia pól. <p/>Uwaga: Niektóre pola są zawsze przeliczane (np. numeracja stron), dlatego ten element dotyczy tylko pól, które zazwyczaj nie są automatycznie przeliczane po otwarciu dokumentu. Należy również pamiętać, że to ustawienie nie może zastępować żadnych ustawień ochrony dokumentów (§17.15.1.29) ani ochrony przed zapisem (§17.15.1.93).

# UseXsltWhenSaving
source: Specifies that this document should be saved through the custom XSLT transform defined by the saveThroughXslt element (§17.15.1.76) in this document when it is saved as a single XML file (not defined by IEEE/IEC 29500). <p/>Guidance: Because this setting specifies behavior when saving to an alternative file format not defined by IEEE/IEC 29500, this behavior is optional. <p/>If the saveXmlDataOnly element (§17.15.1.77) is specified, then the single XML file to be transformed is the custom XML markup of the document, otherwise, it a format outside the scope of IEEE/IEC 29500. If the XSL transform specified by the saveThroughXslt element is not present, then this setting should be ignored.
pl: Określa, że ten dokument powinien zostać zapisany za pomocą niestandardowego przekształcenia XSLT zdefiniowanego przez element saveThroughXslt (§17.15.1.76) w tym dokumencie, gdy jest zapisywany jako pojedynczy plik XML (niezdefiniowany przez IEEE/IEC 29500). <p/>Wskazówka: Ponieważ to ustawienie określa zachowanie podczas zapisywania w alternatywnym formacie pliku, który nie został zdefiniowany przez IEEE/IEC 29500, to zachowanie jest opcjonalne.<p/>Jeśli określono element saveXmlDataOnly (§17.15.1.77), pojedynczy plik XML do przekształcenia jest niestandardowym znacznikiem XML dokumentu, w przeciwnym razie jest to format spoza zakresu IEEE/IEC 29500. Jeśli transformacja XSL określona przez element saveThroughXslt nie jest obecna, to ustawienie powinno zostać zignorowane.

# View
source: Specifies the manner in which the contents of this document should be displayed when opened by an application.
pl: Określa sposób, w jaki zawartość tego dokumentu powinna być wyświetlana po otwarciu przez aplikację.

# WriteProtection
source: Specifies the write protection settings which have been applied to a WordprocessingML document. Write protection refers to a mode in which the document's contents cannot be edited, and the document cannot be resaved using the same file name. This setting is independent of the documentProtection (§17.15.1.29) element, but like document protection, this setting is not intended as a security feature and can be ignored.<p/>When present, the write protection shall result in one of two write protection behaviors:<p/>• If the password attribute is present, or both attributes are omitted, then the application shall prompt for a password to exit write protection. If the supplied password does not match the hash value in this attribute, then write protection shall be enabled.<p/>• If only the recommended attribute is present, the application should provide user interface recommending that the user open this document in write protected state. If the user chooses to do so, the document shall be write protected, otherwise, it shall be opened fully editable.
pl: Określa ustawienia ochrony przed zapisem, które zostały zastosowane do dokumentu WordprocessingML. Ochrona przed zapisem odnosi się do trybu, w którym nie można edytować zawartości dokumentu, a dokument nie może być ponownie zapisany przy użyciu tej samej nazwy pliku. To ustawienie jest niezależne od elementu documentProtection (§17.15.1.29), ale podobnie jak w przypadku ochrony dokumentów, to ustawienie nie jest przeznaczone jako funkcja zabezpieczeń i można je zignorować.<p/>Jeśli jest obecna, ochrona przed zapisem powinna powodować jedno z dwóch zachowań ochrony przed zapisem:<p/>• Jeśli atrybut hasła jest obecny lub oba atrybuty są pominięte, aplikacja poprosi o podanie hasła, aby zakończyć ochronę przed zapisem. Jeśli podane hasło nie jest zgodne z wartością skrótu w tym atrybucie, należy włączyć ochronę przed zapisem.<p/>• Jeśli obecny jest tylko zalecany atrybut, aplikacja powinna udostępnić interfejs użytkownika zalecający użytkownikowi otwarcie tego dokumentu w stanie chronionym przed zapisem. Jeśli użytkownik zdecyduje się to zrobić, dokument będzie chroniony przed zapisem, w przeciwnym razie zostanie otwarty w pełni edytowalny.

# Zoom
source: Specifies the magnification level which should be applied to a document when it is displayed by an application. The zoom level is specified with the use of two attributes stored on this element:<p/>• val, which stores the type of zoom applied to the document<p/>• percent, which stores the zoom percentage to be used when rendering the document<p/>If both attributes are present, then the percent attribute shall be treated as a 'cached' value and only used when the value none is specified for the val attribute.<p/>
pl: Określa poziom powiększenia, który powinien być stosowany do dokumentu po jego wyświetleniu przez aplikację. Poziom powiększenia jest określany za pomocą dwóch atrybutów zapisanych na tym elemencie:<p/>• val, w którym przechowywane są informacje o typie powiększenia zastosowanym do dokumentu<p/>• procent, w którym przechowywana jest wartość procentowa powiększenia, która ma być używana podczas renderowania dokumentu<p/>Jeśli oba atrybuty są obecne, atrybut percent jest traktowany jako wartość §zapisana w pamięci podręcznej§ i używany tylko wtedy, gdy dla atrybutu val określono wartość non.<p/>
