Repository: qhta/DocxEditor
Catalog: DocxControls/Resources/SettingsDescriptions.*.resx
Languages: pl

# DocumentProtection
source: Specifies the set of document protection restrictions which have been applied to the contents of a WordprocessingML document. These restrictions should be enforced by applications editing this document when the enforcement attribute is turned on, and ignored (but persisted) otherwise. Document protection is a set of restrictions used to prevent unintentional changes to all or part of a WordprocessingML document. <p/>Note: This protection does not encrypt the document, and malicious applications might circumvent its use. This protection is not intended as a security feature.
pl: Określa zestaw ograniczeń ochrony dokumentów, które zostały zastosowane do zawartości dokumentu WordprocessingML. Te ograniczenia powinny być wymuszane przez aplikacje edytujące ten dokument, gdy atrybut wymuszania jest włączony i ignorowane (ale utrwalane) w przeciwnym razie. Ochrona dokumentów to zestaw ograniczeń używanych w celu zapobiegania niezamierzonym zmianom w całości lub części dokumentu WordprocessingML. <p/>Uwaga: Ta ochrona nie szyfruje dokumentu, a złośliwe aplikacje mogą obejść jego użycie. Ta ochrona nie jest przeznaczona jako funkcja bezpieczeństwa.

# DocumentType
source: Specifies the classification of a given WordprocessingML document.<p/>Note: This element can be used by hosting applications to facilitate customized user interface and/or automatic formatting behaviors based on the 'type' of a given WordprocessingML document.
pl: Określa klasyfikację danego dokumentu WordprocessingML.<p/>Uwaga: Ten element może być używany przez aplikacje hostingowe w celu ułatwienia dostosowania interfejsu użytkownika i/lub automatycznego formatowania w oparciu o "typ" danego dokumentu WordprocessingML.

# DocumentVariables
source: Specifies the presence of documentvariables in a WordprocessingML. A document variable is a storage location for arbitrary customer data in name/value pairs that is persisted in a given WordprocessingML document.
pl: Określa obecność zmiennych dokumentu w języku WordprocessingML. Zmienna dokumentu to lokalizacja przechowywania dowolnych danych klienta w parach nazwa/wartość, która jest utrwalana w danym dokumencie WordprocessingML.

# DoNotAutoCompressPictures
source: Specifies that pictures in this document shall not automatically be compressed when saving the document in order to reduce the overall size of the resulting WordprocessingML document.
pl: Określa, że obrazy w tym dokumencie nie są automatycznie kompresowane podczas zapisywania dokumentu w celu zmniejszenia ogólnego rozmiaru wynikowego dokumentu WordprocessingML.

# DoNotDemarcateInvalidXml
source: Specifies whether a visual cue should be displayed around content contained in a WordprocessingML document which is contained with custom XML markup specified via the customXml element when an application determines that the current XML markup (or its contents) violate the constraints of the attached XML schema(s).
pl: Określa, czy podpowiedź wizualna powinna być wyświetlana wokół zawartości zawartej w dokumencie WordprocessingML, która jest zawarta z niestandardowym znacznikiem XML określonym za pomocą elementu customXml, gdy aplikacja stwierdzi, że bieżący znacznik XML (lub jego zawartość) narusza ograniczenia dołączonych schematów XML.

# DoNotDisplayPageBoundaries
source: Specifies whether applications displaying this document should display the contents of the header and footer when displaying the document in print layout view (§17.15.1.92) or should collapse those areas as well as the whitespace on all displayed pages so that the text extents are directly following one another. <p/>Rationale: Collapsing the ends of pages makes it easier to read the contents of the document, since the text flows between pages without whitespace, while maintaining the WYSIWYG functionality of print layout view for the document's main content.
pl: Określa, czy aplikacje wyświetlające ten dokument powinny wyświetlać zawartość nagłówka i stopki podczas wyświetlania dokumentu w widoku układu wydruku (§17.15.1.92), czy też powinny zwijać te obszary, a także białe znaki na wszystkich wyświetlanych stronach, tak aby zakresy tekstu znajdowały się bezpośrednio po sobie. <p/>Uzasadnienie: Zwijanie końców stron ułatwia odczytywanie zawartości dokumentu, ponieważ tekst przepływa między stronami bez białych znaków, przy jednoczesnym zachowaniu funkcji WYSIWYG widoku układu wydruku dla głównej zawartości dokumentu.

# DoNotHyphenateCaps
source: Specifies whether or not words comprised of all capital letters shall be hyphenated within a given document when automatic hyphenation is specified via the autoHyphenation element (§17.15.1.10).
pl: Określa, czy wyrazy składające się wyłącznie z wielkich liter mają być dzielone w danym dokumencie, gdy automatyczne dzielenie wyrazów jest określone za pomocą elementu autoHyphenation (§17.15.1.10).

# DoNotIncludeSubdocsInStats
source: Specifies if document content contained in text boxes, footnotes, and endnotes shall be excluded when an application calculates a given document’s statistics when these values are calculated and/or displayed by an application.<p/>Note: Some examples of document statistics that an application might chose to calculate are: number of words, number of characters, number of paragraphs, number of pages, number of lines, and so on.
pl: Określa, czy zawartość dokumentu zawarta w polach tekstowych, przypisach dolnych i końcowych ma być wykluczana, gdy aplikacja oblicza statystyki danego dokumentu, gdy te wartości są obliczane i/lub wyświetlane przez aplikację.<p/>Uwaga: Oto kilka przykładów statystyk dokumentów, które aplikacja może wybrać do obliczenia: liczba słów, liczba znaków, liczba akapitów, liczba stron, liczba wierszy i tak dalej.

# DoNotShadeFormData
source: Specifies whether a visual cue should be displayed around form fields contained in a WordprocessingML document specified via the FORMTEXT, FORMCHECKBOX, or FORMDROPDOWN fields.
pl: Określa, czy podpowiedź wizualna powinna być wyświetlana wokół pól formularza zawartych w dokumencie WordprocessingML określonym za pomocą pól FORMTEXT, FORMCHECKBOX lub FORMDROPDOWN.

# DoNotTrackFormatting
source: Specifies that applications shall not track revisions made to the formatting of this WordprocessingML document when the trackRevisions element (§17.15.1.89) is turned on.
pl: Określa, że aplikacje nie mogą śledzić poprawek wprowadzonych w formatowaniu tego dokumentu WordprocessingML, gdy element trackRevisions (§17.15.1.89) jest włączony.

# DoNotTrackMoves
source: Specifies that applications shall not track revisions made to this WordprocessingML document as moves when the trackRevisions element (§17.15.1.89) is turned on, even when that syntax is appropriate. Instead, applications should use a standard insertion and deletion annotation syntax. Existing moves shall not be modified. <p/>Rationale: This element is provided to enable interoperability with earlier word processing applications which do not understand moves.
pl: Określa, że aplikacje nie mogą śledzić poprawek wprowadzonych do tego dokumentu WordprocessingML podczas ruchu, gdy element trackRevisions (§17.15.1.89) jest włączony, nawet jeśli ta składnia jest odpowiednia. Zamiast tego aplikacje powinny używać standardowej składni adnotacji wstawiania i usuwania. Istniejące ruchy nie mogą być modyfikowane. <p/>Uzasadnienie: Ten element został dostarczony, aby umożliwić interoperacyjność z wcześniejszymi aplikacjami do edycji tekstu, które nie rozumieją ruchów.

# DoNotUseMarginsForDrawingGridOrigin
source: Specifies that the top-left corner of the page shall not be used as the origin for the drawing grid. The drawing grid is a virtual grid which can be used by applications to specify where drawing objects shall be positioned on a page when inserted (i.e. to ensure objects are aligned, etc.). If this element is present the grid shall start at the top-left edge of the page and not the text extents.
pl: Określa, że lewy górny róg strony nie może być używany jako początek siatki rysunku. Siatka rysunkowa to wirtualna siatka, która może być używana przez aplikacje do określania, gdzie obiekty rysunkowe powinny być umieszczone na stronie po wstawieniu (tj. w celu zapewnienia wyrównania obiektów itp.). Jeśli ten element jest obecny, siatka powinna zaczynać się od lewej górnej krawędzi strony, a nie od zakresu tekstu.

# DoNotValidateAgainstSchema
source: Specifies that applications shall not validate the custom XML markup in this document against the applicable custom XML schema(s), even when those schemas are available. The application should silently behave as if it was unable to provide this functionality.
pl: Określa, że aplikacje nie mogą weryfikować niestandardowych znaczników XML w tym dokumencie względem odpowiednich niestandardowych schematów XML, nawet jeśli te schematy są dostępne. Aplikacja powinna zachowywać się po cichu tak, jakby nie była w stanie zapewnić tej funkcji.

# DrawingGridHorizontalOrigin
source: Specifies the distance from of the left edge of the page which shall be used as the origin for the horizontal gridlines used by the drawing grid. The drawing grid is a virtual grid which might be used by applications to specify where drawing objects shall be positioned on a page when inserted (i.e. to ensure objects are aligned, etc.). Since the grid always covers the entire page when the doNotUseMarginsForDrawingGridOrigin element (§17.15.1.42) is specified, this element shall only affect the starting edge of the first horizontal gridline displayed (i.e. it only adjusts the grid by the modulus of the value against the width of one grid unit).
pl: Określa odległość od lewej krawędzi strony, która ma być używana jako początek poziomych linii siatki używanych przez siatkę rysunku. Siatka rysunkowa to wirtualna siatka, która może być używana przez aplikacje do określania, gdzie obiekty rysunkowe powinny być umieszczone na stronie po wstawieniu (np. w celu zapewnienia wyrównania obiektów itp.). Ponieważ siatka zawsze obejmuje całą stronę, gdy określony jest element doNotUseMarginsForDrawingGridOrigin (§17.15.1.42), element ten powinien wpływać tylko na krawędź początkową pierwszej wyświetlanej poziomej linii siatki (tj. dostosowuje siatkę tylko o moduł wartości w stosunku do szerokości jednej jednostki siatki).

# DrawingGridHorizontalSpacing
source: Specifies the width of horizontal grid units in this document. The drawing grid is a grid which can be used by applications to help position floating objects in the document.<p/>If this element is omitted, then each horizontal grid unit shall be 180 twentieths of a point (0.125") in width.
pl: Określa szerokość poziomych jednostek siatki w tym dokumencie. Siatka rysunku to siatka, która może być używana przez aplikacje do określania położenia obiektów przestawnych w dokumencie.<p/>Jeśli ten element zostanie pominięty, każda pozioma jednostka siatki powinna mieć 180 dwudziestych punktu (0,125”) szerokości.

# DrawingGridVerticalOrigin
source: Specifies the distance from of the top edge of the page which shall be used as the origin for the vertical gridlines used by the drawing grid. The drawing grid is a virtual grid which can be used by applications to specify where drawing objects shall be positioned on a page when inserted (i.e. to ensure objects are aligned, etc.). Since the grid always covers the entire page when the doNotUseMarginsForDrawingGridOrigin element (§17.15.1.42) is specified, this element shall only affect the starting edge of the first vertical gridline displayed (i.e. it only adjusts the grid by the modulus of the value against the width of one grid unit).
pl: Określa odległość od górnej krawędzi strony, która ma być używana jako początek pionowych linii siatki używanych przez siatkę rysunku. Siatka rysunkowa to wirtualna siatka, która może być używana przez aplikacje do określania, gdzie obiekty rysunkowe powinny być umieszczone na stronie po wstawieniu (tj. w celu zapewnienia wyrównania obiektów itp.). Ponieważ siatka zawsze obejmuje całą stronę, gdy określony jest element doNotUseMarginsForDrawingGridOrigin (§17.15.1.42), element ten powinien mieć wpływ tylko na krawędź początkową pierwszej wyświetlanej pionowej linii siatki (tj. dostosowuje siatkę tylko o moduł wartości w stosunku do szerokości jednej jednostki siatki).

# DrawingGridVerticalSpacing
source: Specifies the width of vertical grid units in this document. The drawing grid is a grid which can be used by applications to help position floating objects in the document.<p/>If this element is omitted, then each vertical grid unit shall be 180 twentieths of a point (0.125") in width.
pl: Określa szerokość pionowych jednostek siatki w tym dokumencie. Siatka rysunku to siatka, która może być używana przez aplikacje do określania położenia obiektów przestawnych w dokumencie.<p/>Jeśli ten element zostanie pominięty, każda pionowa jednostka siatki powinna mieć 180 dwudziestych punktu (0,125”) szerokości.

# EmbedSystemFonts
source: Specifies that applications shall embed common system fonts when they are in use and font embedding is enabled for this document using the embedTrueTypeFonts element (§17.8.3.8). Common system fonts refer to a set of fonts which are typically always present on a machine, and are not defined by IEEE/IEC 29500.
pl: Określa, że aplikacje powinny osadzać popularne czcionki systemowe, gdy są używane, a osadzanie czcionek jest włączone dla tego dokumentu za pomocą elementu embedTrueTypeFonts (§17.8.3.8). Typowe czcionki systemowe odnoszą się do zestawu czcionek, które zazwyczaj są zawsze obecne na komputerze i nie są zdefiniowane w normie IEEE/IEC 29500.

# EmbedTrueTypeFonts
source: Specifies that applications shall embed the fonts in use in this document when it is saved. These fonts shall be embedded subject to the algorithm specified in §17.8.1.
pl: Określa, że aplikacje powinny osadzać czcionki używane w tym dokumencie podczas jego zapisywania. Czcionki te są osadzane zgodnie z algorytmem określonym w §17.8.1.

# EndnoteDocumentWideProperties
source: Specifies the endnote properties for the current document. Each of these properties are stored as a child element within the endnotePr element.<p/>These properties can be overridden for a specific section via the section-wide endnotePr element (§17.11.5).
pl: Określa właściwości przypisu końcowego dla bieżącego dokumentu. Każda z tych właściwości jest przechowywana jako element podrzędny w elemencie endnotePr.<p/>Te właściwości można zastąpić dla określonej sekcji za pomocą elementu endnotePr dla całej sekcji (§17.11.5).

# EvenAndOddHeaders
source: Specifies whether sections in this document shall have different headers and footers for even and odd pages (an odd page header/footer and an even page header/footer).<p/>If the val attribute is set to true, then each section in the document shall use an odd page header for all odd numbered pages in the section, and an even page header for all even numbered pages in the section (counting each page in the section starting from one, regardless of the page numbering settings for the section). If the val attribute is set to false, then all pages in a section shall use the odd page header.<p/>This setting does not affect the presence of a first page header on each section, which is specified using the titlePg element (§17.10.6). If a first page header is specified, then all subsequent pages shall have this setting applied, including the first page in the odd/even page count.<p/>If this element is set to false and an even page header is specified , then it shall be ignored and only the odd page header shall be displayed. Conversely, if this element is set to true and either header type is omitted for a given section, then a blank header shall be created as needed (another header type shall not be used in its place).
pl: Określa, czy sekcje w tym dokumencie mają mieć różne nagłówki i stopki dla stron parzystych i nieparzystych (nagłówek/stopka strony nieparzystej i nagłówek/stopka strony parzystej).<p/>Jeśli atrybut val jest ustawiony na wartość true, to każda sekcja w dokumencie powinna używać nieparzystego nagłówka strony dla wszystkich stron o numerach nieparzystych w sekcji i nagłówka strony parzystej dla wszystkich stron o numerach parzystych w sekcji (licząc każdą stronę w sekcji zaczynając od jednej, niezależnie od ustawień numeracji stron dla sekcji). Jeśli atrybut val jest ustawiony na false, to wszystkie strony w sekcji powinny używać nieparzystego nagłówka strony.<p/>To ustawienie nie ma wpływu na obecność nagłówka pierwszej strony w każdej sekcji, który jest określony za pomocą elementu titlePg (§17.10.6). Jeśli określono nagłówek pierwszej strony, to ustawienie to zostanie zastosowane na wszystkich kolejnych stronach, w tym na pierwszej stronie w liczbie stron parzystych/nieparzystych.<p/>Jeśli ten element jest ustawiony na false i określony jest nagłówek strony parzystej , to zostanie zignorowany i zostanie wyświetlony tylko nagłówek strony nieparzystej. I odwrotnie, jeśli ten element jest ustawiony na true i któryś z typów nagłówka zostanie pominięty dla danej sekcji, to w razie potrzeby zostanie utworzony pusty nagłówek (w jego miejsce nie należy używać innego typu nagłówka).

# FootnoteDocumentWideProperties
source: Specifies the footnote properties for this document. Each property is stored as a unique element within the footnotePr element.<p/>These properties can be overridden for a specific section via the section-wide footnotePr element (§17.11.11).
pl: Określa właściwości przypisu dolnego dla tego dokumentu. Każda właściwość jest przechowywana jako unikatowy element w elemencie footnotePr.<p/>Te właściwości można zastąpić dla określonej sekcji za pomocą elementu footnotePr dla całej sekcji (§17.11.11).

# ForceUpgrade
source: Specifies that the contents of this document can be upgraded and that the resulting document shall not have its functionality limited to only those functions compatible with earlier word processing applications. The only actions required as part of upgrading the document are:<p/>• The removal of this element. If an application does not know how to upgrade a document, this element should be ignored and persisted.<p/>• The removal of all compatibility options (§17.15.1.21) on the document which maintain compatibility with previous word processing applications. The compatibility settings which simply affect a given behavior shall not be turned off.<p/>Note: The remaining operations which must be performed as part of upgrading the document are application-defined and outside the scope of IEEE/IEC 29500.
pl: Określa, że zawartość tego dokumentu może być uaktualniana i że jego funkcjonalność dokumentu wynikowego nie może być ograniczona tylko do tych funkcji, które są zgodne z wcześniejszymi edytorami tekstu. Jedynymi czynnościami wymaganymi w ramach uaktualniania dokumentu są:<p/>• Usunięcie tego elementu. Jeśli aplikacja nie wie, jak uaktualnić dokument, ten element powinien zostać zignorowany i utrwalony.<p/>• Usunięcie wszystkich opcji kompatybilności (§17.15.1.21) w dokumencie, które zachowują kompatybilność z poprzednimi edytorami tekstu. Ustawienia kompatybilności, które po prostu wpływają na dane zachowanie, nie mogą być wyłączone.<p/>Uwaga: Pozostałe operacje, które muszą zostać wykonane w ramach aktualizacji dokumentu, są zdefiniowane przez aplikację i nie wchodzą w zakres normy IEEE/IEC 29500.

# FormsDesign
source: Specifies that the document was last saved while the placeholder text of all structured document tags in this document were being edited. This means that the placeholder text currently displayed in all structured document tags which are displaying the showingPlcHdr element (§17.5.2.39) shall be committed to the corresponding glossary document entry as specified using the docPart element (§17.12.5) when this document is opened, in order to ensure that the most recent placeholder text is stored in the glossary document entry. If the current placeholder text cannot be saved as a glossary document entry, then it should be modified as needed before saving.
pl: Określa, że dokument został ostatnio zapisany w czasie, gdy edytowany był tekst zastępczy wszystkich znaczników dokumentu strukturalnego w tym dokumencie. Oznacza to, że tekst zastępczy aktualnie wyświetlany we wszystkich znacznikach dokumentu strukturalnego, w których wyświetlany jest element showingPlcHdr (§17.5.2.39), zostanie przypisany do odpowiedniego wpisu dokumentu glosariusza, jak określono za pomocą elementu docPart (§17.12.5) po otwarciu tego dokumentu, aby zapewnić, że najnowszy tekst zastępczy zostanie zapisany we wpisie dokumentu glosariusza. Jeśli bieżącego tekstu zastępczego nie można zapisać jako pozycji dokumentu glosariusza, należy go zmodyfikować zgodnie z potrzebami przed zapisaniem.

# GutterAtTop
source: Specifies that a given WordprocessingML document’s gutter shall be positioned at the top of the document’s pages when the document is displayed. A gutter is the white space formed by the inner margins of two pages facing one another; such as the white space between the text on pages of a book when the book is opened.<p/>If this element is omitted, then the gutter shall not be positioned at the top of the page. If the mirrorMargins (§17.15.1.57), bookFoldPrinting (§17.15.1.11), bookFoldRevPrinting (§17.15.1.13), or printTwoOnOne (§17.15.1.64) elements are used within a given document, the gutterAtTop element shall not be used. Rather, the gutter shall be positioned automatically as necessary to enable the printing and page layout capabilities of these settings.
pl: Określa, że margines na oprawę danego dokumentu WordprocessingML powinien być umieszczony u góry stron dokumentu podczas wyświetlania dokumentu. Margines na oprawę to biały obszar utworzony przez wewnętrzne marginesy dwóch stron zwróconych do siebie, na przykład biały obszar między tekstem na stronach książki, gdy książka jest otwarta.<p/>Jeśli ten element zostanie pominięty, to margines na oprawę nie zostanie umieszczony u góry strony. Jeśli w danym dokumencie używane są elementy mirrorMargins (§17.15.1.57), bookFoldPrinting (§17.15.1.11), bookFoldRevPrinting (§17.15.1.13) lub printTwoOnOne (§17.15.1.64), element gutterAtTop nie będzie używany. Zamiast tego margines na oprawę powinien być ustawiany automatycznie, jeśli jest to konieczne, aby umożliwić drukowanie i układ strony w tych ustawieniach.

# HeaderShapeDefaults
source: Specifies the default parameters for object using the VML syntax (§14.1) inserted in the header and footer of a WordprocessingML document. The definition and semantics of these parameters is described in the VML - Office Drawing subclause (§14.2) of IEEE/IEC 29500.
pl: Określa domyślne parametry obiektu przy użyciu składni VML (§14.1) wstawionej w nagłówku i stopce dokumentu WordprocessingML. Definicja i semantyka tych parametrów jest opisana w podpunkcie VML - Office Drawing (§14.2) normy IEEE/IEC 29500.

# HideGrammaticalErrors
source: Specifies whether a visual cue should be displayed around run content contained in a WordprocessingML document which has been flagged as a possible grammatical error using the proofErr element (§17.13.8.1) or via the application's own grammar engine.
pl: Określa, czy podpowiedź wizualna powinna być wyświetlana wokół zawartości uruchamiania zawartej w dokumencie WordprocessingML, który został oznaczony jako możliwy błąd gramatyczny przy użyciu elementu proofErr (§17.13.8.1) lub za pośrednictwem własnego aparatu gramatycznego aplikacji.
