Repository: qhta/DocxEditor
Catalog: DocxControls/Resources/SettingsDescriptions.*.resx
Languages: pl

# HideSpellingErrors
source: Specifies whether a visual cue should be displayed around run content contained in a WordprocessingML document which has been flagged as a possible spelling error using the proofErr element (§17.13.8.1) or via the application's own spelling engine.
pl: Określa, czy wizualna wskazówka powinna być wyświetlana wokół zawartości uruchamiania zawartej w dokumencie WordprocessingML, który został oznaczony jako możliwy błąd pisowni przy użyciu elementu proofErr (§17.13.8.1) lub za pośrednictwem własnego silnika sprawdzania pisowni aplikacji.

# HyphenationZone
source: Specifies the hyphenation zone which shall be used when automatically or manually hyphenating the contents of this document. The hyphenation zone is the amount of whitespace which can be left at the end of a line (or added to justified lines) before hyphenation should be attempted on the next word in the document (in order to reduce the amount of whitespace on the line). A smaller hyphenation zone should reduce the raggedness of the right edge of a given document's body text, as more words is hyphenated. Conversely, a larger hyphenation zone should increase the raggedness of the right edge of a given document's text, as fewer words is hyphenated.<p/>If this element is omitted, then a default hyphenation zone of 360 twentieths of a point (0.25") shall be applied when performing hyphenation on this document.
pl: Określa strefę dzielenia wyrazów, która ma być używana podczas automatycznego lub ręcznego dzielenia wyrazów w zawartości tego dokumentu. Strefa dzielenia wyrazów to ilość białych znaków, którą można pozostawić na końcu wiersza (lub dodać do wyjustowanych wierszy) przed próbą dzielenia wyrazów w następnym słowie w dokumencie (w celu zmniejszenia ilości białych znaków w wierszu). Mniejsza strefa dzielenia wyrazów powinna zmniejszyć nierówność prawej krawędzi tekstu podstawowego danego dokumentu, ponieważ dzielenie wyrazów jest większą liczbą wyrazów. I odwrotnie, większa strefa dzielenia wyrazów powinna zwiększyć nierówność prawej krawędzi tekstu danego dokumentu, ponieważ dzieli się mniej wyrazów.<p/>Jeśli ten element zostanie pominięty, podczas dzielenia wyrazów w tym dokumencie zostanie zastosowana domyślna strefa dzielenia wyrazów wynosząca 360 dwudziestych punktu (0,25§).

# IgnoreMixedContent
source: Specifies that applications should ignore all text content which is not contained within a leaf custom XML markup element when validating the contents of the custom XML markup in this document against one or more attached custom XML schema(s). A leaf element is a custom XML element which has no child custom XML elements (it is a leaf in the custom XML tree).
pl: Określa, że aplikacje powinny ignorować całą zawartość tekstową, która nie jest zawarta w niestandardowym elemencie znacznika XML liścia, podczas sprawdzania poprawności zawartości niestandardowego znacznika XML w tym dokumencie względem co najmniej jednego dołączonego niestandardowego schematu XML. Element liścia to niestandardowy element XML, który nie ma podrzędnych niestandardowych elementów XML (jest to liść w niestandardowym drzewie XML).

# LinkStyles
source: Specifies that styles in the given document shall be updated to match the styles in the attached template specified using the attachedTemplate element (§17.15.1.6) when the document is opened by a hosting application. This setting enables the styles contained in documents with attached templates to stay synchronized with the styles used in the attached template.
pl: Określa, że style w danym dokumencie są aktualizowane tak, aby były zgodne ze stylami w dołączonym szablonie określonym za pomocą elementu attachedTemplate (§17.15.1.6), gdy dokument jest otwierany przez aplikację hostingową. To ustawienie umożliwia synchronizację stylów zawartych w dokumentach z dołączonymi szablonami ze stylami używanymi w dołączonym szablonie.

# ListSeparator
source: Specifies the character that shall be interpreted as a list item separator when evaluating the contents of all fields in the current document.<p/>Rationale: When evaluating field instructions based on the contents of the current document, it is necessary to know the character which must be treated as the list separator in order to prevent changes to the calculation of the same field instructions based on the current user's locale. This element stores the list separator which must be used to evaluate fields in the contents of this document, irrespective of the locale of the application loading the file.
pl: Określa znak, który ma być interpretowany jako separator elementu listy podczas oceniania zawartości wszystkich pól w bieżącym dokumencie.<p/>Uzasadnienie: Podczas oceniania instrukcji pól na podstawie zawartości bieżącego dokumentu, konieczna jest znajomość znaku, który musi być traktowany jako separator listy, aby zapobiec zmianom w obliczaniu tych samych instrukcji pól na podstawie ustawień regionalnych bieżącego użytkownika. Ten element przechowuje separator listy, który musi być używany do oceny pól w zawartości tego dokumentu, niezależnie od ustawień regionalnych aplikacji ładującej plik.

# MailMerge
source: Specifies all of the mail merge information for a document that has been connected to an external data source as part of a mail merge operation.<p/>The document which contains this mail merge data can be of one of two types:<p/>• A source document, the document which contains all of the information for the mail merge, and is used in conjunction with an application to connect to an external data source and create one document for each record in that data source.<p/>• A merged document, a document which contains all of the information for the mail merge as well as a reference to a single specific record which shall be used to populate the values of all of the merge fields in that document.<p/>The information in this element shall contain all data needed to connect to a data source and populate any merge fields in the document with data from that data source.
pl: Określa wszystkie informacje dotyczące korespondencji seryjnej dla dokumentu, który został połączony z zewnętrznym źródłem danych w ramach operacji korespondencji seryjnej.<p/>Dokument zawierający dane korespondencji seryjnej może być jednego z dwóch typów:<p/>• Dokument źródłowy, czyli dokument zawierający wszystkie informacje dotyczące korespondencji seryjnej, używany w połączeniu z aplikacją do łączenia się z zewnętrznym źródłem danych i tworzenia jednego dokumentu dla każdego rekordu w tym źródle danych.<p/>• Scalony dokument, dokument zawierający wszystkie informacje dotyczące korespondencji seryjnej, a także odniesienie do pojedynczego konkretnego rekordu, który zostanie użyty do wypełnienia wartości wszystkich pól korespondencji seryjnej w tym dokumencie.<p/>Informacje w tym elemencie zawierają wszystkie dane potrzebne do nawiązania połączenia ze źródłem danych i wypełnienia wszelkich pól scalanych w dokumencie danymi z tego źródła danych.

# MathProperties
source: Specifies the document-level properties for all math in the document.
pl: Określa właściwości na poziomie dokumentu dla wszystkich elementów matematycznych w dokumencie.

# MirrorMargins
source: Specifies that the left and right margins defined in the section properties shall be swapped on facing pages.<p/>Guidance: This setting is generally used when printing on both sides of pages and binding them like a book.
pl: Określa, że lewy i prawy margines zdefiniowany we właściwościach sekcji mają być zamienione miejscami na stronach sąsiadujących.<p/>Wskazówka: To ustawienie jest zwykle używane podczas drukowania na obu stronach stron i oprawiania ich jak książki.

# NoLineBreaksAfterKinsoku
source: Specifies the set of characters which shall be restricted from ending a line for runs of text which shall be subject to custom line breaking logic using the kinsoku element (§17.3.1.16) when the contents of the document are displayed. This constraint shall only apply to text which has been flagged in the language of this rule via the lang element (§17.3.2.20) or automatic detection methods outside the scope of IEEE/IEC 29500.
pl: Określa zestaw znaków, który nie może kończyć wiersza dla ciągów tekstu, które podlegają niestandardowej logice dzielenia wierszy przy użyciu elementu kinsoku (§17.3.1.16) podczas wyświetlania zawartości dokumentu. To ograniczenie ma zastosowanie tylko do tekstu, który został oznaczony w języku tej reguły za pomocą elementu lang (§17.3.2.20) lub metod automatycznego wykrywania poza zakresem IEEE/IEC 29500.

# NoLineBreaksBeforeKinsoku
source: Specifies the set of characters which shall be restricted from beginning a new line for runs of text which shall be subject to custom line breaking logic using the kinsoku element (§17.3.1.16) when the contents of the document are displayed. This constraint shall only apply to text which has been flagged in the language of this rule via the lang element (§17.3.2.20) or automatic detection methods outside the scope of IEEE/IEC 29500.
pl: Określa zestaw znaków, który powinien być ograniczony od początku nowego wiersza dla przebiegów tekstu, które podlegają niestandardowej logice dzielenia wierszy przy użyciu elementu kinsoku (§17.3.1.16) podczas wyświetlania zawartości dokumentu. To ograniczenie ma zastosowanie tylko do tekstu, który został oznaczony w języku tej reguły za pomocą elementu lang (§17.3.2.20) lub metod automatycznego wykrywania poza zakresem IEEE/IEC 29500.

# NoPunctuationKerning
source: Specifies that punctuation characters shall not be kerned in the current document when kerning is enabled on a run using the kern element (§17.3.2.19). Kerning refers to a process by which a hosting application shall reduce the spacing of adjacent characters and/or punctuation to improve the visual appearance of text. Well kerned text has a similar amount of blank space between each pair of characters and/or each set of a character and punctuation symbol. When kerning is enabled, Latin text shall always be kerned, and this option shall control whether punctuation characters are also kerned.
pl: Określa, że znaki interpunkcyjne nie mogą być kerowane w bieżącym dokumencie, gdy kerning jest włączony w przebiegu przy użyciu elementu kern (§17.3.2.19). Kerning odnosi się do procesu, w którym aplikacja hostująca zmniejsza odstępy między sąsiadującymi znakami i/lub interpunkcją w celu poprawy wyglądu tekstu. Tekst o dobrym kerze ma podobną ilość spacji między każdą parą znaków i/lub każdym zestawem znaku i symbolu interpunkcyjnego. Gdy kerning jest włączony, tekst łaciński jest zawsze kerningowany, a opcja ta określa, czy kerningowane są również znaki interpunkcyjne.

# PersistentDocumentId
source: Specifies a unique identifier for a set of documents derived from a common source. The possible values for this attribute are defined by the ST_Guid simple type
pl: Określa unikatowy identyfikator zestawu dokumentów pochodzących ze wspólnego źródła. Możliwe wartości tego atrybutu są definiowane przez ST_Guid typ simple

# PrintFormsData
source: Specifies that printing the contents of this document shall only print the contents of WordprocessingML form fields defined using the FORMTEXT, FORMCHECKBOX, and FORMDROPDOWN field codes in their current locations on the page - all other document contents shall be suppressed.<p/>Rationale: This setting is typically used to allow duplication of paper forms in electronic WordprocessingML document form, allowing the resulting online document to be printed into the correct locations on the existing paper form.
pl: Określa, że drukowanie zawartości tego dokumentu powoduje wydrukowanie tylko zawartości pól formularza WordprocessingML zdefiniowanych za pomocą kodów pól FORMTEXT, FORMCHECKBOX i FORMDROPDOWN w ich bieżących lokalizacjach na stronie — cała pozostała zawartość dokumentu zostanie pominięta.<p/>Uzasadnienie: To ustawienie jest zwykle używane, aby umożliwić powielanie formularzy papierowych w elektronicznym formularzu dokumentu WordprocessingML, co pozwala na wydrukowanie wynikowego dokumentu online w odpowiednich miejscach na istniejącym formularzu papierowym.

# PrintFractionalCharacterWidth
source: Specifies the contents of this document shall be printed with fractional character widths. Fractional character widths exist when the spacing between characters is not constant (i.e. a proportional font face is used).<p/>Note: Fractional character widths are generally used in conjunction with large font sizes to prevent characters from running together or having too much space between one another.
pl: Określa, że zawartość tego dokumentu powinna być drukowana z szerokością ułamkową. Ułamkowe szerokości znaków występują, gdy odstępy między znakami nie są stałe (tj. używany jest proporcjonalny krój czcionki).<p/>Uwaga: Ułamkowe szerokości znaków są zwykle używane w połączeniu z dużymi rozmiarami czcionek, aby zapobiec zbieganiu się znaków lub zbyt dużej odległości między nimi.

# PrintPostScriptOverText
source: Specifies that the PostScript codes specified in WordprocessingML documents containing PRINT fields shall be included in foreground (on the same Z-order as text) with the data printed in the contents of a given WordprocessingML document.<p/>Note: This setting is maintained to ensure compatibility of legacy word processing documents. The PRINT field should not be used in lieu of newer technologies in IEEE/IEC 29500.
pl: Określa, że kody PostScript określone w dokumentach WordprocessingML zawierających pola PRINT mają być dołączane na pierwszym planie (w tej samej kolejności Z co tekst) z danymi drukowanymi w treści danego dokumentu WordprocessingML.<p/>Uwaga: To ustawienie jest zachowywane w celu zapewnienia zgodności starszych dokumentów edytora tekstu. Pole PRINT nie powinno być używane zamiast nowszych technologii w IEEE/IEC 29500.

# PrintTwoOnOne
source: Specifies whether two pages should be printed on one sheet of paper when this document is printed. Specifically, this element specifies that each page displayed for the contents in a given WordprocessingML document should be the page size specified in the section settings divided in half with two top margins originating from the bisector of the page, and bottom margins instantiated at the top and bottom of each page.
pl: Określa, czy podczas drukowania tego dokumentu na jednym arkuszu papieru powinny być drukowane dwie strony. W szczególności ten element określa, że każda strona wyświetlana dla zawartości w danym dokumencie WordprocessingML powinna mieć rozmiar strony określony w ustawieniach sekcji podzielony na pół z dwoma górnymi marginesami pochodzącymi z dwusiecznej strony i dolnymi marginesami utworzonymi u góry i u dołu każdej strony.

# ProofState
source: Specifies if the grammar and spell checking engines of the last application to process this document completed checking the grammar and spelling of a the document before the document was last saved. Applications which modify the document contents without checking spelling or grammar should reset these states as needed.<p/>Note: If this element specifies that an application's grammar and spell checking engines completed checking the grammar and spelling of the document when the document was last saved, then subsequent applications might elect to not run their grammar and spell checking engines when the given WordprocessingML document is loaded.<p/>This might increase the speed with which the hosting application loads the file, and does not compromise the state of the grammar or spell checking of the document, as all errors have already been found and flagged with the proofErr element (§17.13.8.1) as the document has not been edited, only loaded, since it was last saved.
pl: Określa, czy aparaty sprawdzania gramatyki i pisowni ostatniej aplikacji, która przetwarzała ten dokument, zakończyły sprawdzanie gramatyki i pisowni dokumentu przed jego ostatnim zapisaniem. Aplikacje, które modyfikują zawartość dokumentu bez sprawdzania pisowni lub gramatyki, powinny w razie potrzeby zresetować te stany.<p/>Uwaga: Jeśli ten element określa, że mechanizmy sprawdzania gramatyki i pisowni aplikacji zakończyły sprawdzanie gramatyki i pisowni dokumentu podczas ostatniego zapisywania dokumentu, kolejne aplikacje mogą zdecydować się nie uruchamiać swoich aparatów sprawdzania gramatyki i pisowni po załadowaniu danego dokumentu WordprocessingML.<p/>Może to zwiększyć szybkość, z jaką aplikacja hostująca ładuje plik i nie wpływa negatywnie na stan sprawdzania gramatyki lub pisowni dokumentu, ponieważ wszystkie błędy zostały już znalezione i oznaczone za pomocą elementu proofErr (§17.13.8.1), ponieważ dokument nie był edytowany, a jedynie załadowany, od czasu ostatniego zapisanego.

# ReadModeInkLockDown
source: Specifies the exact set of page and text sizing parameters which shall be used to display the contents of a WordprocessingML document. <p/>Rationale: This setting is typically used for documents that have been annotated using ink. This setting freezes the document's presentation such that the ink annotations must exist at the same position of the WordprocessingML document irrespective of the monitor on which the WordprocessingML document is rendered. <p/>This element shall only affect the display of WordprocessingML documents as follows:<p/>• When the actualPage attribute is specified with a value of true, the given WordprocessingML document's pages shall be rendered as they would normally be displayed. The resulting pages can have their magnification setting changed as desired. All other attributes shall be ignored.<p/>• When the actualPage attribute is specified with a value of false, the given WordprocessingML document's pages shall be rendered as virtual pages when loaded by a conforming hosting application irrespective of the given WordprocessingML document's view (§17.15.1.92). Virtual pages are pages with no correlation with the printed layout of a given WordprocessingML document that have been scaled by a conforming hosting application to improve the readability of a given WordprocessingML document when it is displayed. Specifically, the w and h attributes specify the width and height of the virtual pages, and the fontSz attribute specifies the scaling to be applied to text within the given WordprocessingML document.
pl: Określa dokładny zestaw parametrów zmiany rozmiaru strony i tekstu, które mają być używane do wyświetlania zawartości dokumentu WordprocessingML. <p/>Uzasadnienie: To ustawienie jest zwykle używane w przypadku dokumentów, które zostały opatrzone adnotacjami przy użyciu pisma odręcznego. To ustawienie powoduje zablokowanie prezentacji dokumentu w taki sposób, że adnotacje odręczne muszą znajdować się w tym samym miejscu co dokument WordprocessingML, niezależnie od monitora, na którym jest renderowany dokument WordprocessingML. <p/>Ten element ma wpływ na wyświetlanie dokumentów WordprocessingML tylko w następujący sposób:<p/>• Jeśli atrybut actualPage jest określony z wartością true, strony danego dokumentu WordprocessingML są renderowane tak, jak normalnie byłyby wyświetlane. Powstałe strony mogą mieć dowolne zmiany ustawień powiększenia. Wszystkie inne atrybuty nie są brane pod uwagę.<p/>• Jeśli atrybut actualPage jest określony z wartością false, strony danego dokumentu WordprocessingML będą renderowane jako strony wirtualne po załadowaniu przez zgodną aplikację hostingową, niezależnie od widoku danego dokumentu WordprocessingML (§17.15.1.92). Strony wirtualne to strony, które nie są skorelowane z wydrukowanym układem danego dokumentu WordprocessingML, które zostały przeskalowane przez zgodną aplikację hostingową w celu poprawy czytelności danego dokumentu WordprocessingML po jego wyświetleniu. W szczególności atrybuty w i h określają szerokość i wysokość stron wirtualnych, a atrybut fontSz określa skalowanie, które ma zostać zastosowane do tekstu w danym dokumencie WordprocessingML.

# RemoveDateAndTime
source: Specifies that the date and time information shall be removed from all annotations which are present in the current document when it is saved. Annotations store this information in the date attribute on the annotation's XML element.
pl: Określa, że informacje o dacie i godzinie mają być usuwane ze wszystkich adnotacji, które znajdują się w bieżącym dokumencie w momencie jego zapisywania. Adnotacje przechowują te informacje w atrybucie date w elemencie XML adnotacji.

# RemovePersonalInformation
source: Specifies that hosting applications shall remove all personal information of document authors upon saving a given WordprocessingML document. The definition and extent of personal information is not defined by IEEE/IEC 29500.
pl: Określa, że aplikacje hostujące powinny usuwać wszystkie dane osobowe autorów dokumentów po zapisaniu danego dokumentu WordprocessingML. Definicja i zakres danych osobowych nie są zdefiniowane w normie IEEE/IEC 29500.

# RevisionView
source: Specifies which forms of annotations shall be visible for a WordprocessingML document when it is displayed. This setting shall not affect whether annotations are added or persisted, it shall only affect the display of the annotations which exist in the document's contents (persisted or in memory).
pl: Określa, które formy adnotacji powinny być widoczne dla dokumentu WordprocessingML po jego wyświetleniu. To ustawienie nie ma wpływu na to, czy adnotacje są dodawane, czy utrwalane, ma wpływ tylko na wyświetlanie adnotacji, które istnieją w treści dokumentu (trwałe lub w pamięci).

# Rsids
source: Specifies the set of revision save ID values for the current document. Revision save ID values refer to four digit hexadecimal values which uniquely identify an editing session in the life of the current document. An editing session is the period of time between two subsequent save operations by an application.<p/>Guidance: The set of revision save IDs stored with a document only supplies information about the editing session in which document components were last saved, which can be used by applications in any manner desired.
pl: Określa zestaw wartości identyfikatora zapisu poprawki dla bieżącego dokumentu. Wartości identyfikatora zapisu wersji odnoszą się do czterocyfrowych wartości szesnastkowych, które jednoznacznie identyfikują sesję edycji w czasie życia bieżącego dokumentu. Sesja edycji to okres czasu między dwiema kolejnymi operacjami składowania przez aplikację.<p/>Wskazówka: Zestaw identyfikatorów zapisu wersji przechowywanych z dokumentem zawiera tylko informacje o sesji edycji, w której składniki dokumentu zostały ostatnio zapisane, które mogą być używane przez aplikacje w dowolny sposób.

# SaveFormsData
source: Specifies that saving the contents of this document shall only save the contents of WordprocessingML form fields defined using the FORMTEXT, FORMCHECKBOX, and FORMDROPDOWN field codes in a comma-delimited text format which does not conform to IEEE/IEC 29500 (i.e. it is a one-way export from a WordprocessingML document).<p/>Rationale: This setting is typically used to allow duplication of paper forms in electronic WordprocessingML document form, allowing the resulting content to be extracted as a comma-delimited text file.
pl: Określa, że zapisanie zawartości tego dokumentu spowoduje zapisanie tylko zawartości pól formularza WordprocessingML zdefiniowanych przy użyciu kodów pól FORMTEXT, FORMCHECKBOX i FORMDROPDOWN w formacie tekstowym rozdzielanym przecinkami, który nie jest zgodny z normą IEEE/IEC 29500 (tj. jest to jednokierunkowy eksport z dokumentu WordprocessingML).<p/>Uzasadnienie: To ustawienie jest zwykle używane, aby umożliwić powielanie formularzy papierowych w elektronicznym formularzu dokumentu WordprocessingML, co pozwala na wyodrębnienie wynikowej zawartości jako pliku tekstowego rozdzielanego przecinkami.
