Repository: qhta/DocxEditor
Catalog: DocxControls/Resources/SettingsCaptions.*.resx
Languages: pl

source: Active writing style
pl: Aktywny styl pisania

source: Align border and edges
pl: Wyrównywanie obramowania i krawędzi

source: Always merge empty namespace
pl: Zawsze scalaj pustą przestrzeń nazw

source: Always show placeholder text
pl: Zawsze pokazuj tekst zastępczy

source: Attached schema
pl: Dołączony schemat

source: Attached template
pl: Załączony szablon

source: Auto format override
pl: Automatyczne zastępowanie formatowania

source: Auto hyphenation
pl: Automatyczne dzielenie wyrazów

source: Book fold printing
pl: Drukowanie przy składaniu książek

source: Book fold printing sheets
pl: Arkusze do drukowania składu

source: Book fold reverse printing
pl: Odwrotne drukowanie składu

source: Borders do not surround footer
pl: Obramowania nie otaczają stopki

source: Borders do not surround header
pl: Obramowania nie otaczają nagłówka

source: Captions
pl: Podpisy

source: Character spacing control
pl: Kontrolka odstępów między znakami

source: Chart tracking ref based
pl: Śledzenie wykresu oparte na odnośnikach

source: Click and type style
pl: Styl "kliknij i pisz"

source: Color scheme mapping
pl: Mapowanie schematu kolorów

source: Compatibility
pl: Zgodność

source: Conflict mode
pl: Tryb konfliktu

source: Consecutive hyphen limit
pl: Limit łączników kolejnych

source: Decimal symbol
pl: Symbol dziesiętny

source: Default image dpi
pl: Domyślna rozdzielczość obrazu

source: Default table style
pl: Domyślny styl tabeli

source: Default tab stop
pl: Domyślny tabulator

source: Discard image editing data
pl: Odrzuć dane edycji obrazu

source: Display background shape
pl: Wyświetlanie kształtu tła

source: Display horizontal drawing grid
pl: Wyświetlanie poziomej siatki rysunku

source: Display vertical drawing grid
pl: Wyświetlanie pionowej siatki rysunku

source: Document id
pl: Identyfikator dokumentu

source: Document protection
pl: Ochrona dokumentu

source: Document type
pl: Typ dokumentu

source: Document variables
pl: Zmienne dokumentu

source: Do not auto compress pictures
pl: Nie kompresuj zdjęć automatycznie

source: Do not demarcate invalid xml
pl: Nie rozdzielaj nieprawidłowego kodu XML

source: Do not display page boundaries
pl: Nie wyświetlaj granic strony

source: Do not hyphenate caps
pl: Nie dziel wielkich liter

source: Do not include subdocs in stats
pl: Nie uwzględniaj dok. podrzędnych w statystykach

source: Do not shade form data
pl: Nie cieniuj danych formularza

source: Do not track formatting
pl: Nie śledź formatowania

source: Do not track moves
pl: Nie śledź ruchów

source: Do not use margins for drawing grid origin
pl: Pomiń marginesy na początku siatki rysunku

source: Do not validate against schema
pl: Nie weryfikuj względem schematu

source: Drawing grid horizontal origin
pl: Początek wsp. poziomych siatki rysunku

source: Drawing grid horizontal spacing
pl: Odstępy poziome siatki rysunku

source: Drawing grid vertical origin
pl: Początek wsp. pionowych siatki rysunku

source: Drawing grid vertical spacing
pl: Odstępy pionowe siatki rysunku

source: Embed system fonts
pl: Osadzanie czcionek systemowych

source: Embed true type fonts
pl: Osadzanie czcionek true type

source: Endnote document wide properties
pl: Właściwości przypisów końcowych

source: Even and odd headers
pl: Parzyste i nieparzyste nagłówki

source: Footnote document wide properties
pl: Właściwości przypisów dolnych

source: Force upgrade
pl: Wymuś uaktualnienie

source: Forms design
pl: Projektowanie formularzy

source: Gutter at top
pl: Zszywanie na górze

source: Header shape defaults
pl: Domyślne ustawienia kształtu nagłówka

source: Hide grammatical errors
pl: Ukrywanie błędów gramatycznych

source: Hide spelling errors
pl: Ukrywanie błędów pisowni

source: Hyphenation zone
pl: Strefa dzielenia wyrazów

source: Ignore mixed content
pl: Ignoruj zawartość mieszaną

source: Link styles
pl: Style linków

source: List separator
pl: Separator listy

source: Mail merge
pl: Korespondencja seryjna

source: Math properties
pl: Właściwości matematyczne

source: Mirror margins
pl: Marginesy lustrzane

source: No line breaks after kinsoku
pl: Brak podziałów wierszy po kinsoku

source: No line breaks before kinsoku
pl: Brak podziałów wierszy przed kinsoku

source: No punctuation kerning
pl: Brak kerningu interpunkcyjnego

source: Persistent document id
pl: Trwały identyfikator dokumentu

source: Print forms data
pl: Drukowanie danych formularzy

source: Print fractional character width
pl: Drukuj szerokość znaku ułamkowego

source: Print post script over text
pl: Drukuj PostScript na tekście

source: Print two on one
pl: Drukowanie dwóch na jednym

source: Proof state
pl: Stan sprawdzania

source: Read mode ink lock down
pl: Blokada układu w trybie odczytu

source: Remove date and time
pl: Usuń datę i godzinę

source: Remove personal information
pl: Usuwanie danych osobowych

source: Revision view
pl: Widok rewizji

source: Rsids
pl: Identyfikatory RSID

source: Save forms data
pl: Zapisywanie danych formularzy

source: Save invalid xml
pl: Zapisz nieprawidłowy kod XML

source: Save preview picture
pl: Zapisz obraz podglądu

source: Save subset fonts
pl: Zapisywanie czcionek podzbioru

source: Save throughXSLT
pl: Zapisywanie przez XSLT

source: Save xml data only
pl: Zapisywanie tylko danych XML

source: Schema library
pl: Biblioteka schematów

source: Shape defaults
pl: Wartości domyślne kształtów

source: Show envelope
pl: Pokaż kopertę

source: Show XML tags
pl: Pokaż znaczniki XML

source: Strict first and last chars
pl: Ścisły pierwszy i ostatni znak

source: Style lock styles part
pl: Blokada definicji styli

source: Style lock themes part
pl: Blokada definicji motywu

source: Style pane format filter
pl: Filtr formatu okienka stylu

source: Style pane sort methods
pl: Metody sortowania w okienku stylu

source: Summary length
pl: Długość podsumowania

source: Theme font languages
pl: Języki czcionek motywu

source: Track revisions
pl: Śledzenie poprawek

source: Ui compatible with 97 to 2003
pl: Interfejs zgodny z wersjami od 97 do 2003

source: Update fields on open
pl: Aktualizowanie pól przy otwieraniu

source: Use XSLT when saving
pl: Użyj XSLT podczas zapisywania

source: View
pl: Widok

source: Write protection
pl: Ochrona przed zapisem

source: Zoom
pl: Powiększenie

# LoadSaveAndSecurity
source: Load, save, security
pl: Zapis i bezpieczeństwo

source: Theming and styles
pl: Motyw i style

# ProofingHyphenationAndAutomation
source: Proof, hyph., automat.
pl: Pisownia, przenosz., automat.

source: Custom XML
pl: Dowolny XML

source: Identification
pl: Identyfikacja

source: Layout and UI
pl: Wygląd i interfejs

source: Mail merge and printing
pl: Koresp. seryjna i drukowanie

source: Revisions and tracking
pl: Recencja i śledzenie
